Repository: NERC-CEH/dunes-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: About
cy: Am yr Ap

source: Credits
cy: Cydnabyddiaeth

source: Home
cy: Hafan

source: Species
cy: Rhywogaethau

source: Habitats
cy: Cynefinoedd

source: Surveys
cy: Arolygon

source: Back
cy: Nôl

source: Beach
cy: Traeth

source: Strandline
cy: Traethlin

source: Embryo Dune
cy: Egin-dwyn

source: Mobile Dune
cy: Twyn Symudol

source: Semi-fixed Dune
cy: Twyn Lled Sefydlog

source: Fixed Dune
cy: Twyn Sefydlog

source: Dune Slack
cy: Llac Twyni

source: Heath
cy: Rhostir

source: Scrub and Woodland
cy: Prysgoed a Choetir

source: Feature
cy: Nodwedd

source: Habitat
cy: Cynefin

source: Pending
cy: I'w cyflwyno

source: Uploaded
cy: Wedi'u cyflwyno

source: No finished pending surveys
cy: Dim un arolwg cyflawn i'w gyflwyno

source: No uploaded surveys
cy: Dim un arolwg wedi'i gyflwyno

source: Upload
cy: Cyflwyno

source: Date
cy: Dyddiad

source: Delete
cy: Dileu

source: Survey
cy: Arolwg

source: Draft
cy: Drafft

source: Fixed-point Photography
cy: Ffotograffiaeth Pwynt Sefydlog

source: Zonation Mapping
cy: Mapio Parthau

source: Plant Quadrat Recording
cy: Cofnodi Cwadradau Planhigion

source: Water Table Depth
cy: Lefel Trwythiad

source: Dunes Profile
cy: Proffil Twyni

source: Cancel
cy: Canslo

source: OK
cy: Iawn

source: Are you sure you want to delete this survey?
cy: Ydych chi'n siŵr eich bod am ddileu'r arolwg hwn?

source: Previous survey draft exists, would you like to continue it?
cy: Mae drafft blaenorol o'r arolwg yn bodoli. Hoffech chi barhau ag ef?

source: Discard
cy: Diddymu

source: Continue
cy: Parhau

source: Surveyors
cy: Arolygwyr

source: Notes
cy: Nodiadau

source: Transects
cy: Trawsluniau

source: Transect
cy: Trawslun

source: Please add any extra information about your survey.
cy: Rhowch unrhyw wybodaeth ychwanegol am eich arolwg.

source: Enter more information here...
cy: Rhowch fwy o wybodaeth yma...

source: Name
cy: Enw

source: If anyone has helped with the surveying please enter their names here.
cy: Os oes unrhyw un wedi helpu gyda'r arolwg, rhowch eu henwau yma.

source: Refresh
cy: Adnewyddu

source: Please select your transect first.
cy: Dewiswch eich trawslun yn gyntaf.

source: Please wait...
cy: Un foment...

source: Transect list was successfully updated.
cy: Diweddarwyd y rhestr o drawsluniau.

source: Sorry, looks like you're offline.
cy: Sori, dydych chi ddim i weld ar-lein.

source: Oops! Something, went wrong.
cy: Wps! Mae rhywbeth wedi mynd o'i le.

source: This is the error event id: {{eventId}}
cy: Dyma rif adnabod yr achos o wall: {{eventId}}

source: Settings
cy: Gosodiadau

source: Share App Analytics
cy: Rhannu Data Dadansoddi'r Ap

source: Share app crash data so we can make the app more reliable.
cy: Rhannwch ddata'r ap am chwalfeydd i'n helpu i wneud yr ap yn fwy dibynadwy.

source: Reset
cy: Ailosod

source: Are you sure you want to reset the application to its initial state?
cy: Ydych chi'n siŵr eich bod am ailosod yr ap i'w gyflwr gwreiddiol?

source: This will wipe all the locally stored app data!
cy: Bydd hyn yn dileu holl ddata'r ap sydd wedi'i storio'n lleol.

source: Skip
cy: Neidio

source: Sorry
cy: Sori

source: Done
cy: Wedi gorffen

source: Language
cy: Iaith

source: Fixed points
cy: Pwyntiau sefydlog

source: Point
cy: Pwynt

source: Next
cy: Nesaf

source: Disturbance
cy: Tarfiad

source: Are you sure you want to remove this photo?
cy: Ydych chi'n siŵr eich bod am ddileu'r llun hwn?

source: Note: it will remain in the gallery.
cy: Nodwch: bydd yn aros yn yr oriel.

source: Please add any extra information about the disturbance.
cy: Rhowch unrhyw wybodaeth ychwanegol am y tarfiad.

source: No photo has been added
cy: Nid oes llun wedi'i ychwanegu

source: Finish
cy: Gorffen

source: Choose a method to upload a photo
cy: Dewiswch ffordd o lwytho llun i fyny

source: Gallery
cy: Oriel

source: Grid Ref
cy: Cyfeirnod Grid

source: Please add a photo below.
cy: Ychwanegwch lun isod.

source: Adding photographs
cy: Ychwanegu lluniau

source: Got it
cy: Deall

source: No photo has been added.
cy: Nid oes llun wedi'i ychwanegu.

source: Press <1></1> to add.
cy: Pwyswch <1></1> i ychwanegu.

source: Each photograph should be taken in the direction of the bearing of the transect i.e. pointing inland towards your next photography point.
cy: Dylid tynnu pob llun gan ddilyn cyfeiriant y trawslun, h.y. yn pwyntio tua'r tir at bwynt eich ffotograff nesaf.

source: Take the photograph at eye level.
cy: Tynnwch y llun ar lefel y llygad.

source: Enter your email address to request a password reset.
cy: Rhowch eich cyfeiriad e-bost i ofyn am gael ailosod eich cyfrinair.

source: Email
cy: E-bost

source: Create a free account
cy: Creu cyfrif am ddim

source: Full Name
cy: Enw llawn

source: Password
cy: Cyfrinair

source: By clicking Sign Up, you agree to our <2>Privacy Policy</2> and <6>Terms and Conditions</6>
cy: Drwy glicio Cofrestru, rydych chi'n cytuno i'n <2>Polisi Preifatrwydd</2> a'n <6>Telerau ac Amodau</6>

source: Sign Up
cy: Cofrestru

source: Sign In
cy: Mewngofnodi

source: Welcome back
cy: Croeso nôl

source: Welcome aboard!
cy: Croeso!

source: Sign in to your account to start
cy: Mewngofnodwch i'ch cyfrif er mwyn cychwyn

source: Username or email
cy: Enw defnyddiwr neu e-bost

source: Forgot password?
cy: Wedi anghofio'ch cyfrinair?

source: password is a required field
cy: Mae'n rhaid rhoi cyfrinair

source: email is a required field
cy: Mae'n rhaid rhoi e-bost

source: email is not valid
cy: Nid yw'r e-bost yn ddilys

source: fullName is a required field
cy: Mae'n rhaid rhoi enw llawn

source: name is a required field
cy: Mae'n rhaid rhoi enw

source: Project Website
cy: Gwefan y Prosiect

source: Dunes are Exciting!
cy: Mae Twyni'n Gyfareddol!

source: Encompassing a beautiful mosaic of habitat types, coastal sand dunes are home to amazing native wildlife including diverse plant communities that support specialist sand dune animals.
cy: Yn frithwaith prydferth o wahanol fathau o gynefinoedd, mae twyni tywod arfordirol yn gartref i fywyd gwyllt brodorol arbennig, yn cynnwys cymunedau llawn amrywiaeth o blanhigion sy'n cefnogi anifeiliaid arbenigol y twyni.

source: Dunes are Threatened.
cy: Mae Twyni o dan Fygythiad.

source: These habitats are suffering from biodiversity loss and habitat change, but you can help us bring life back into the dunes.
cy: Mae'r cynefinoedd hyn yn dioddef o golled bioamrywiaeth a newid i gynefinoedd, ond gallwch chi'n helpu i adfywio'r twyni.

source: English
cy: Saesneg

source: Welsh
cy: Cymraeg

source: Bare sand and no vegetation.
cy: Tywod noeth a dim llystyfiant.

source: Lots of bare sand.
cy: Llawer o dywod noeth.

source: Annual plants present; may include sea rocket and prickly seawort.
cy: Planhigion unflwydd yn bresennol; efallai'n cynnwys hegydd arfor a helys pigog.

source: Miniature sand dunes are formed around these plants.
cy: Mae twyni tywod bychain yn ffurfio o amgylch y planhigion hyn.

source: Above the usual high tide line.
cy: Uwchlaw'r llinell penllanw arferol.

source: First perennial plants present; may include sand couch and lyme grass.
cy: Planhigion lluosflwydd cyntaf yn bresennol; efallai'n cynnwys marchwellt y twyni a chlymwellt.

source: Low, hummocky dunes form around these plants.
cy: Twmpathau o dwyni isel yn ffurfio o amgylch y planhigion hyn.

source: Lots of bare sand (10-50%).
cy: Llawer o dywod noeth (10-50%).

source: Marram grass dominates.
cy: Moresg yn dominyddu.

source: Sand builds up around marram to form high, mobile dunes.
cy: Tywod yn cronni o amgylch y moresg i ffurfio twyni symudol uchel.

source: A small number of other plants may be present; may include sea holly and sea spurge.
cy: Gall fod nifer fechan o blanhigion eraill yn bresennol; efallai'n cynnwys celyn y môr a llaethlys y môr.

source: Bare sand cover reduced.
cy: Llai o dywod noeth ar yr wyneb.

source: Red fescue and mosses cover patches between marram.
cy: Peiswellt coch a mwsogl yn gorchuddio'r tywod rhwng y moresg.

source: Species diversity increasing; may include restharrow, sand sedge, birds foot trefoil.
cy: Mwy o amrywiaeth o rywogaethau; efallai'n cynnwys tagaradr, hesg y tywod a phys-y-ceirw.

source: No real soil layer.
cy: Dim haen go iawn o bridd.

source: Bare sand is only where turf is broken (less than 10%).
cy: Dim ond ble mae toriad yn y glaswellt mae tywod noeth (llai na 10%).

source: Soil beginning to form.
cy: Pridd yn dechrau ffurfio.

source: Many plants now coexisting; may include red fescue, lady’s bedstraw, harebell.
cy: Llawer o blanhigion yn cydfodoli bellach; efallai'n cynnwys peiswellt coch, briwydd felen a chlychau'r eos.

source: Surface lichens and mosses may be present.
cy: Gall fod cen a mwsogl ar yr wyneb.

source: Little if any scrub or tree cover.
cy: Dim llawer o brysgoed neu goed ar yr wyneb, os o gwbl.

source: Flat, low-lying area.
cy: Ardal o dir gwastad ac isel.

source: Usually floods in winter.
cy: Yn llenwi â dŵr yn y gaeaf fel arfer.

source: Can be very large.
cy: Gall fod yn fawr iawn.

source: Species may include sedges, water mint, mosses and liverworts, creeping willow.
cy: Gall fod y rhywogaethau'n cynnwys hesg, mintys y dŵr, mwsogl a llysiau'r afu, a chorhelyg.

source: Soil is dry, acidic and nutrient-poor.
cy: Y pridd yn sych, yn asidaidd ac yn brin o faetholion.

source: Plants present are those associated with acid grassland and heaths; may include heather.
cy: Y planhigion sy'n bresennol yn gysylltiedig â glaswelltiroedd asidaidd a rhostiroedd; efallai'n cynnwys grug.

source: Dominance of tall, woody perennials and understorey species.
cy: Planhigion lluosflwydd prennaidd tal a rhywogaethau'r isdyfiant yn dominyddu.

source: Very little if any bare sand.
cy: Ychydig iawn o dywod noeth, os o gwbl.

source: Description
cy: Disgrifiad

source: Distribution
cy: Dosbarthiad

source: Account
cy: Cyfrif

source: Logout
cy: Allgofnodi

source: Citizen Science Manual
cy: Llawlyfr Gwyddoniaeth y Dinesydd

source: Activities
cy: Gweithgareddau

source: Please do not forget to upload any pending surveys!
cy: Peidiwch ag anghofio cyflwyno unrhyw arolygon sy'n aros i'w cyflwyno!

source: Hide
cy: Cuddio

source: No finished pending surveys.<br/><br/>Press <4></4> to add.
cy: Dim un arolwg cyflawn i'w gyflwyno.<br/><br/>Pwyswch <4></4> i ychwanegu.

source: To delete any surveys swipe it to the left.
cy: I ddileu arolwg, llusgwch yr arolwg i'r chwith.

source: Comment
cy: Sylw

source: Location
cy: Lleoliad

source: Site
cy: Safle

source: You can find this survey information in our volunteer manual.
cy: Gallwch ddod o hyd i wybodaeth am yr arolwg hwn yn ein llawlyfr i wirfoddolwyr.

source: Please add photos of your visit.
cy: Ychwanegwch luniau o'ch ymweliad.

source: Please select your location.
cy: Dewiswch eich lleoliad.

source: Survey incomplete
cy: Arolwg heb ei gwblhau

source: Survey Point
cy: Pwynt Arolwg

source: Start
cy: Dechrau

source: End
cy: Diwedd

source: Add Point
cy: Ychwanegu Pwynt

source: You have not added any points yet.
cy: Dydych chi ddim wedi ychwanegu pwynt eto.

source: People
cy: Pobl

source: We are very grateful for all the people that helped to create this app:
cy: Rydym yn ddiolchgar iawn i'r holl bobl sydd wedi helpu i greu'r ap hwn:

source: App Development
cy: Datblygu'r Ap

source: This app was hand crafted with love by <2>Flumens.</2> A technical consultancy that excels at building bespoke environmental science and community focussed solutions. For suggestions and feedback please do not hesitate to <6>contact us</6>.
cy: Crëwyd yr ap hwn gyda chariad gan <2>Flumens</2>, ymgynghorwyr technegol sy'n arbenigo mewn datblygu datrysiadau pwrpasol ym maes gwyddoniaeth amgylcheddol a chan flaenoriaethu cymunedau. Os oes awgrymiadau neu adborth gennych chi, <6>cysylltwch â ni</6>ar bob cyfrif.

source: Graphics
cy: Graffeg

source: Icons made by <2>Freepik</2>, <5>Srip</5>, and <8>Kiranshastry</8> from <12>www.flaticon.com</12>
cy: Eiconau gan <2>Freepik</2>, <5>Srip</5>, a <8>Kiranshastry</8> o <12>www.flaticon.com</12>

source: Photos
cy: Ffotograffau

source: Home page:
cy: Hafan:

source: Habitats:
cy: Cynefinoedd:

source: To see fixed points please select your site and transect first.
cy: I weld y pwyntiau sefydlog, dewiswch eich safle a'ch trawslun yn gyntaf.

source: read more
cy: darllen mwy

source: Sites
cy: Safleoedd

source: Please specify the water level in centimeters from the top of dipwell down to the water. If the water is above the dipwell (i.e. flooded) please use negative values.
cy: Nodwch lefel y dŵr mewn centimetrau o ben y bibell drochi hyd at y dŵr. Os yw'r dŵr uwchlaw'r bibell drochi (h.y. yn gorlifo), defnyddiwch werthoedd negyddol.

source: Please add any extra information about this dipwell.
cy: Rhowch unrhyw wybodaeth ychwanegol am y bibell drochi hon.

source: location
cy: lleoliad

source: To see dipwells please select your site and transect first.
cy: I weld y pibelli trochi, dewiswch eich safle a'ch trawslun yn gyntaf.

source: Dipwell
cy: Pibell drochi

source: Dipwells
cy: Pibelli trochi

source: Water Depth
cy: Dyfnder y Dŵr

source: Choose point type
cy: Dewiswch y math o bwynt

source: Type
cy: Math

source: Angle
cy: Ongl

source: Distance
cy: Pellter

source: Please specify the distance of the slope in meters.
cy: Nodwch bellter y llethr mewn metrau.

source: Please specify the angle of the slope.
cy: Nodwch ongl y llethr.

source: Please specify the type of the slope.
cy: Nodwch y math o lethr.

source: Downslope
cy: Llethr i lawr

source: Upslope
cy: Llethr i fyny

source: Recorded Points
cy: Pwyntiau wedi'u Cofnodi

source: Point Photo
cy: Llun o'r Pwynt

source: start
cy: dechrau

source: end
cy: diwedd

source: point
cy: pwynt

source: Vegetation Cover
cy: Llystyfiant ar yr Wyneb

source: Bare ground & Sand
cy: Tir a Thywod noeth

source: Moss & Lichen
cy: Mwsogl a Chen

source: Grasses
cy: Gweiriau

source: Herbs
cy: Planhigion llysieuol

source: Shrubs
cy: Prysglwyni

source: Scrub
cy: Prysgoed

source: Please specify the % of the grasses, sedges and rushes cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio gan wair, hesg a brwyn.

source: Vegetation Height
cy: Uchder y Llystyfiant

source: Please specify the vegetation height in cm.
cy: Nodwch uchder y llystyfiant mewn cm.

source: Quadrat group
cy: Grŵp cwadrad

source: Quadrat groups
cy: Grwpiau cwadrad

source: To see quadrats please select your site and quadrat group first.
cy: I weld y cwadradau, dewiswch eich safle a'r grŵp cwadrad yn gyntaf.

source: You don't have any transects. Please try to refresh the list.
cy: Does dim trawsluniau gyda chi. Ceisiwch adnewyddu'r rhestr.

source: You don't have any sites. Please try to refresh the list.
cy: Does dim safleoedd gyda chi. Ceisiwch adnewyddu'r rhestr.

source: You don't have any quadrat groups. Please try to refresh the list.
cy: Does dim grwpiau cwadrad gyda chi. Ceisiwch adnewyddu'r rhestr.

source: Please log in to refresh the data.
cy: Mewngofnodwch i adnewyddu'r data.

source: Quadrat
cy: Cwadrad

source: Quadrats
cy: Cwadradau

source: Vegetation
cy: Llystyfiant

source: Cover
cy: Arwyneb

source: Height
cy: Uchder

source: Indicator Species
cy: Rhywogaethau Dangosol

source: Health
cy: Iechyd

source: Quadrat Photo
cy: Llun o'r Cwadrad

source: Please specify the % of the bare ground and sand cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio gan dir a thywod noeth.

source: Please specify the % of the moss and lichen cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio gan fwsogl a chen.

source: Please specify the % of the herbs cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio gan blanhigion llysieuol.

source: Please specify the % of the heathland shrubs cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio gan brysglwyni rhostir.

source: Please specify the % of the scrub and woodland cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio gan brysgoed a choetir.

source: email must be a valid email
cy: Rhaid i'r e-bost fod yn un dilys

source: Are you sure you want to logout?
cy: Ydych chi'n siŵr eich bod am allgofnodi?

source: Navigate
cy: Llywio

source: open survey manual
cy: agor llawlyfr yr arolwg

source: Register/Login
cy: Cofrestru/Mewngofnodi

source: Discard local data
cy: Diddymu'r data lleol

source: I am already a member
cy: Rwy'n aelod eisoes

source: The user credentials were incorrect.
cy: Roedd manylion y defnyddiwr yn anghywir.

source: Successfully logged in as
cy: Llwyddwyd i fewngofnodi fel

source: Manual
cy: Llawlyfr

source: OK, got it
cy: Iawn, deall

source: Click the link in the email to reset your password. If you don't see the email, check other places like your junk, spam or other folders.
cy: Cliciwch y ddolen yn yr e-bost i ailosod eich cyfrinair. Os na allwch weld yr e-bost, gwiriwch mewn mannau eraill, fel eich ffolder sothach neu ffolderi eraill.

source: Before submitting any records please check your email and click on the verification link.
cy: Cyn cyflwyno unrhyw gofnodion, edrychwch yn eich e-bost a chlicio'r ddolen dilysu.

source: By identifying and recording plant species, you can help scientists and conservationists protect and restore biodiverse sand dune habitats in England and Wales, using this app. With a beautiful range of habitats, coastal sand dunes are home to some amazing wildlife – including butterflies, lizards, toads and orchids. As a citizen scientist, you’ll help researchers gather vital sand dune habitat and species data to help strengthen the understanding of what’s going on in coastal sand dune environments, and to help improve the conservation work that is being done.
cy: Drwy adnabod a chofnodi rhywogaethau o blanhigion, gallwch helpu gwyddonwyr a chadwraethwyr i warchod ac adfer cynefinoedd twyni tywod sy'n llawn amrywiaeth yng Nghymru a Lloegr, drwy ddefnyddio'r ap hwn. Mae twyni tywod arfordirol yn cwmpasu ystod eang o gynefinoedd hyfryd, ac maent yn gartref i fywyd gwyllt arbennig - yn cynnwys glöynnod byw, madfallod, llyffantod a thegeirianau. Fel gwyddonydd-ddinesydd, byddwch yn helpu ymchwilwyr i gasglu data hanfodol am gynefinoedd a rhywogaethau'r twyni tywod er mwyn cryfhau'r ddealltwriaeth o beth sy'n digwydd mewn amgylcheddau twyni tywod arfordirol, ac i helpu i wella'r gwaith cadwraeth sy'n cael ei wneud.

source: From monitoring species to taking part in transect or quadrat surveys, explore the range of citizen science activities in the app which you can get involved in, and share your findings in the app when you next visit your chosen sand dune site.
cy: O fonitro rhywogaethau i gymryd rhan mewn arolygon trawslun neu gwadrad, archwiliwch yr ystod o weithgareddau sydd yn yr ap y gallwch gymryd rhan ynddynt fel gwyddonydd-ddinesydd, a rhannwch eich canfyddiadau yn yr ap y tro nesaf y byddwch yn ymweld â'r twyni tywod a ddewisoch fel safle.

source: Dynamic Dunescapes is a partnership project supported by the National Lottery Heritage Fund and the EU LIFE Programme. Project partners are Natural England, Plantlife, Natural Resources Wales, National Trust and The Wildlife Trusts.
cy: Mae Twyni ar Symud yn brosiect partneriaeth wedi'i gefnogi gan Gronfa Treftadaeth y Loteri Genedlaethol a rhaglen LIFE yr UE. Partneriaid y prosiect yw Natural England, Plantlife, Cyfoeth Naturiol Cymru, yr Ymddiriedolaeth Genedlaethol a'r Ymddiriedolaethau Natur.

source: Transition
cy: Man trosiannol

source: transition
cy: man trosiannol

source: Previous Habitat
cy: Cynefin Blaenorol

source: New Habitat
cy: Cynefin Newydd

source: Please specify the distance from previous transition point in meters.
cy: Nodwch y pellter o'r pwynt trosiannol blaenorol mewn metrau.

source: Please specify the new habitat type.
cy: Nodwch y math newydd o gynefin.

source: Please specify the previous habitat type.
cy: Nodwch y math blaenorol o gynefin.

source: Unrecognized username or email address.
cy: Enw defnyddiwr neu e-bost heb ei adnabod.

source: Please log in first to upload the records.
cy: Mewngofnodwch yn gyntaf er mwyn cyflwyno'r cofnodion.

source: Please check why the total cover is less than 100%. Remember to record bare ground/sand.
cy: Gwiriwch pam fod cyfanswm yr arwynebedd yn llai na 100%. Cofiwch gofnodi tir/tywod noeth.

source: Please add at least one photo.
cy: Ychwanegwch un llun o leiaf.

source: Please add water depth value.
cy: Rhowch werth ar gyfer dyfnder y dŵr.

source: Please add points to the survey.
cy: Ychwanegwch bwyntiau at yr arolwg.

source: Please add location.
cy: Rhowch leoliad.

source: Grid Reference
cy: Cyfeirnod Grid

source: Please add type.
cy: Rhowch y math.

source: Please add angle.
cy: Rhowch ongl.

source: Please add distance.
cy: Rhowch y pellter.

source: Please add previous habitat.
cy: Rhowch y cynefin blaenorol.

source: Please add new habitat.
cy: Rhowch y cynefin newydd.

source: Please select the disturbance type for this record.
cy: Dewiswch y math o darfiad ar gyfer y cofnod hwn.

source: Less than 1 metre across
cy: Llai nag 1 metr ar draws

source: More than 1 metre across
cy: Mwy nag 1 metr ar draws

source: Rabbit
cy: Cwningen

source: Rabbit activity
cy: Gweithgarwch cwningod

source: Cattle
cy: Buwch

source: Pony
cy: Merlyn

source: Sheep
cy: Dafad

source: Unknown
cy: Anhysbys

source: Scrape
cy: Man wedi'i sgrafellu

source: Burrow
cy: Twll cwningen

source: Animal dung
cy: Baw anifail

source: Vehicle tracks
cy: Olion cerbyd

source: Litter/flytipping
cy: Sbwriel/tipio

source: Fires/BBQ remnants
cy: Gweddillion tân/barbeciw

source: Other (please add a comment)
cy: Arall (gadewch sylw)

source: Bare sand/poached area
cy: Tywod noeth/ardal wedi'i fathru

source: Other
cy: Arall

source: Record Disturbance
cy: Cofnodi Tarfiad

source: Downloading images.
cy: Yn llwytho delweddau i lawr.

source: Changing location
cy: Yn newid y lleoliad

source: Warning - This will discard some of the survey information you have entered so far.
cy: Rhybudd - Bydd hyn yn diddymu rhywfaint o'r wybodaeth rydych wedi'i rhoi yn yr arolwg hyd yma.

source: No group name
cy: Dim enw grŵp

source: Getting locations.
cy: Yn cynnull y lleoliadau.

source: List was successfully updated.
cy: Diweddarwyd y rhestr.

source: Background
cy: Cefndir

source: The aim of this activity is twofold. Firstly, to measure the length of the sand dune and secondly, combining this with recording where zones change from one to another along each transect. Photographing and noting the GPS location of transitions between different zones of the sand dune system will help to monitor how these boundaries change over time. Transitions are the abrupt or gradual change of habitat from one type to another, for example from a mobile dune to a semi-fixed, or to other habitats of fixed dune, bare sand around newly restored/scraped areas or blowouts, scrub encroachment, and dune slack boundaries.
cy: Mae dwy nod i'r gweithgaredd hwn. Yn gyntaf, mesur hyd y twyn. Ac yn ail, cyfuno hynny gyda chofnodi ble mae'r parthau'n newid o un i'r nesaf ar hyd pob trawslun. Drwy dynnu ffotograffau a nodi lleoliad GPS y mannau trosiannol rhwng gwahanol barthau system y twyni tywod bydd hynny'n helpu i fonitro sut mae'r ffiniau hyn yn newid dros amser. Ystyr trosiannol yw ble mae newid sydyn neu raddol o un math o gynefin i un arall, er enghraifft, o dwyn symudol i dwyn lled sefydlog, neu i gynefinoedd eraill mewn twyn sefydlog, tywod noeth o amgylch mannau sydd newydd eu hadfer/sgrafellu neu chwythbant, prysgoed yn ymledu, a ffiniau llaciau twyni.

source: Method
cy: Dull

source: When and where to survey
cy: Ble a phryd i gynnal arolwg

source: Equipment
cy: Cyfarpar

source: Navigating to and along the transect
cy: Llywio at y trawslun ac ar ei hyd

source: What to record along the transect
cy: Beth i'w gofnodi ar hyd y trawslun
