Repository: NERC-CEH/dunes-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: Zonation surveys are carried out once a year, in April or May, along the fixed transect routes that have been selected at your site. It will take roughly take between 1 to 3 hours per transect.
cy: Caiff arolygon parth eu cynnal unwaith y flwyddyn, ym mis Ebrill neu Mai, ar hyd y llwybrau trawslun sefydlog sydd wedi'u dewis yn eich safle. Yn fras, bydd angen rhwng 1 a 3 awr ar gyfer pob trawslun.

source: Take with you:<1><0>Handheld GPS unit</0><1>Mobile phone app - transect locations downloaded beforehand</1><2>Compass</2><3>Long tape measure (ideally 50 m or more)</3><4>Marker canes with high visibility tape/ribbon (suggested minimum 3)</4></1>
cy: Ewch â'r canlynol gyda chi:<1><0>Uned law GPS</0><1>Ap ffôn symudol - gyda'r lleoliadau trawslun wedi'u lawrlwytho ymlaen llaw</1><2>Cwmpawd</2><3>Tâp mesur hir (50 m neu'n hirach yn ddelfrydol)</3><4>Ffyn marcio gyda thâp/rhuban llachar (awgrymir 3 o leiaf)</4></1>

source: <0><0>Using your handheld GPS (and mobile phone app), navigate to the first point of the transect, which will be marked by a post. The grid reference can be found on the transect description form, or the start point described on the app.</0><1>Use the grid reference for the end of the transect and your compass (and your mobile phone app) to navigate along the transect. The 3 marker canes can help you keep to the transect. Place the first marker cane at the start point. Following the bearing provided for the transect, navigate along the transect roughly 50 metres & place the second marker cane. A person sited at the first marker cane, holding the compass can then direct the location of the third marker cane to be placed 50m further down the transect. When all 3 canes are aligned, walk back to the first cane and start recording the transitions. The first one, then second can be removed and the process repeated from the third cane to move down the transect. Some transects may be shorter than 100m. Adjust the method if required to maintain line of sight between marker canes. For transects ending at the beach, the last point will be on the beach itself.</1><2>Use the tape measure to measure the distance between locations, and record the distance between zonation transition points.</2></0>
cy: <0><0>Gan ddefnyddio'ch uned GPS (a'r ap ffôn symudol), llywiwch at bwynt cyntaf y trawslun, a fydd wedi'i farcio gan bostyn. Gellir gweld y cyfeirnod grid ar ffurflen disgrifio'r trawslun, neu'r pwynt cychwynnol sydd wedi'i ddisgrifio ar yr ap.</0><1>Defnyddiwch y cyfeirnod grid ar gyfer diwedd y trawslun a'ch cwmpawd (a'ch ap ffôn symudol) i lywio ar hyd y trawslun. Gall y 3 ffon farcio eich helpu i gadw at y trawslun. Rhowch y ffon farcio gyntaf wrth y pwynt cychwynnol. Gan ddilyn y cyfeiriant a roddir ar gyfer y trawslun, llywiwch ar hyd y trawslun am tua 50 metr a gosod yr ail ffon farcio. Wedyn gall rhywun sy'n sefyll wrth y ffon farcio gyntaf, gan ddal y cwmpawd, roi lleoliad y drydedd ffon farcio i'w gosod 50m arall ar hyd y trawslun. Pan fo'r 3 ffon wedi'u halinio, cerddwch yn ôl at y ffon gyntaf a dechrau cofnodi'r mannau trosiannol. Gellir tynnu'r ffon farcio gyntaf ac wedyn yr ail, a gellir ailadrodd y broses o'r drydedd ffon i symud ar hyd y trawslun. Efallai bydd rhai trawsluniau yn fyrrach na 100m. Addaswch y dull os oes angen i sicrhau y gallwch weld yn glir rhwng y ffyn marcio. Yn achos trawsluniau sy'n gorffen ar y traeth, bydd y pwynt olaf ar y traeth ei hun.</1><2>Defnyddiwch y tâp mesur i fesur y pellter rhwng lleoliadau, a chofnodwch y pellter rhwng pwyntiau trosiannol parthau.</2></0>

source: <0><0>As you walk along the transect, use the sand dune zone guide to assess which zone you are in (Figure 1). When you move from one zone to another, record the grid reference from your GPS (if using the manual recording form), along with the names of the zones you are moving between. The app will guide you through this when you enter a new transition point.</0><1></1><2>Figure 1. Diagram of zones in a sand dune system.</2><br/><4>Record the distance from the last transition point, in metres and to the nearest 10 cm.</4><5>At each transition point, take two photographs perpendicular to the direction of the transect (one to the left, and one to the right). On the manual recording form, note down the time that these photographs were taken so that they can be identified and stored correctly. On the app, the time of photos will be recorded automatically.</5><6>Notes:<1><0>The transition between different zones may not be clear cut but you should record the point at which you feel the dominance of characteristics has shifted from one zone type to another.</0><1>You may also transition from one zone to another and then back again – each transition should be recorded on the form. Anything larger than 2 metres can be considered a new zone.</1><2>On very loose sand on a steep dune, it may be necessary to walk a few metres away from the direct line to avoid disturbing the dune, but track back to the direct line to take the next measurement.</2><3>The end point for some transects may be a scrub or woodland boundary – in this case, measure to where the scrub/woodland forms a fairly unbroken line (not individual bushes or trees).</3><4>The end point of the transect for transects leading onto the shore should be approximately 5 m seawards from the edge of the strandline.</4></1></6></0>
cy: <0><0>Wrth i chi gerdded ar hyd y trawslun, defnyddiwch y canllaw i barthau twyni tywod i asesu ym mha barth yr ydych chi (Ffigur 1). Wrth i chi symud o un parth i'r nesaf, cofnodwch y cyfeirnod grid o'ch uned GPS (os ydych chi'n defnyddio'r ffurflen cofnodi â llaw), ynghyd ag enwau'r parthau rydych chi'n symud rhyngddynt . Bydd yr ap yn eich arwain drwy hyn wrth i chi symud i bwynt trosiannol newydd.</0><1></1><2>Ffigur 1. Diagram o barthau mewn system twyni tywod.</2><br/><4>Cofnodwch y pellter o'r pwynt trosiannol diwethaf, mewn metrau ac i'r 10 cm agosaf. Wrth bob pwynt trosiannol, tynnwch ddau ffotograff ar ongl sgwâr i gyfeiriad y trawslun (un i'r chwith, ac un i'r dde). Ar y ffurflen cofnodi â llaw, nodwch yr amser y tynnwyd y lluniau hyn fel y gellir eu hadnabod a'u storio'n gywir. Ar yr ap, caiff amser y ffotograffau eu cofnodi'n ddiofyn.</5><6>Nodiadau:<1><0>Efallai na fydd y mannau trosiannol rhwng gwahanol barthau yn amlwg, ond dylech nodi'r pwynt ble rydych chi'n teimlo bod y nodweddion sy'n dominyddu wedi symud o un math o barth i un arall.</0><1>Mae'n bosibl y byddwch hefyd yn symud o un math o barth i un arall, ac yn ôl wedyn – dylid nodi pob achos o drosi ar y ffurflen. Gellir ystyried unrhyw beth sy'n fwy na 2 fetr yn barth newydd.</1><2>Ar dywod rhydd iawn ar dwyn serth, efallai y bydd angen cerdded rai metrau oddi wrth y llinell uniongyrchol er mwyn osgoi tarfu ar y twyn, ond ewch yn ôl at y llinell uniongyrchol i gymryd y mesuriad nesaf.</2><3>Mae'n bosibl y bydd y pwynt terfynol ar gyfer rhai trawsluniau yn ffin gyda phrysgoed neu goetir – yn yr achosion hyn, mesurwch hyd at ble mae'r prysgoed/coetir yn ffurfio llinell gymharol ddi-dor (nid llwyni neu goed unigol). Yn achos trawsluniau sy'n arwain at y lan, dylai pwynt terfynol y trawslun fod tua 5 m tuag at y môr o ymyl y traethlin.</4></1></6></0>

source: The aim of this survey is to develop a visual record of the sand dune system using fixed point photographs. This will allow assessments to be made of how the morphology and vegetation composition of sites are changing over time.
cy: Nod yr arolwg hwn yw datblygu cofnod gweledol o'r system twyni tywod gan ddefnyddio ffotograffau pwynt sefydlog. Bydd hyn yn caniatáu gwneud asesiadau o sut mae morffoleg safleoedd a chyfansoddiad eu llystyfiant yn newid dros amser.

source: Navigating to the photography points
cy: Llywio at y pwyntiau ffotograff

source: What to record
cy: Beth i'w gofnodi

source: <0><0>Take a photograph at each photography point. The important thing here is to take your photograph so it matches the position of the original photo (see the list of locations, or the app) so that direct comparisons can be made. To help you do this:<1><0>Each photograph should be taken in the direction indicated (as aligned with the guide photo)</0><1>Take the photograph at eye level</1><2>Refer back to the photographs shown in the transect description form, or on the app. If there are any useful reference points (e.g. trees, buildings), make sure these are in the same place in your new photograph.</2></1></0><1>For each photograph, record the time it was taken on the recording form so that it can be identified and stored correctly. This will be recorded automatically on the app.</1></0>
cy: <0><0>Tynnwch lun wrth bob pwynt ffotograff. Y peth pwysig yw tynnu'r llun fel ei fod yn cyd-fynd â lleoliad y ffotograff gwreiddiol (gweler y rhestr o leoliadau, neu'r ap) er mwyn gallu cymharu'n uniongyrchol. I'ch helpu i wneud hyn:<1><0>Dylid tynnu pob llun yn y cyfeiriad a nodir (wedi'i alinio â'r llun cynorthwyol)</0><1>Tynnwch y llun ar lefel y llygad</1><2>Cyfeiriwch yn ôl at y ffotograffau a ddangosir yn y ffurflen disgrifio trawslun, neu ar yr ap. Os oes nodweddion cyfeirio defnyddiol (e.e. coed, adeiladau), sicrhewch fod y rhain yn yr un lle yn eich ffotograff newydd.</2></1></0><1>Ar gyfer pob ffotograff, cofnodwch yr amser y tynnwyd y llun ar y ffurflen gofnodi er mwyn gallu ei adnabod a'i storio yn gywir. Caiff hyn ei gofnodi'n ddiofyn ar yr ap.</1></0>

source: The aim of this activity is to create a height profile of key areas of interest in the sand dune system. These are likely to focus on naturally mobile dunes, blow-outs and managed or rejuvenated areas which have created bare sand. This can then be used to examine how the height profile of the sand dunes is changing over time and how much dynamism there is in the system.
cy: Nod y gweithgaredd hwn yw creu proffil uchder o fannau allweddol o ddiddordeb yn y system twyni tywod. Mae'n debygol y bydd y rhain yn canolbwyntio ar dwyni sy'n naturiol symudol, chwythbantau a mannau wedi'u rheoli neu eu hadfywio sydd wedi creu tywod noeth. Wedyn gellir defnyddio hyn i archwilio sut mae proffil uchder y twyni tywod yn newid dros amser a pha mor ddeinamig yw'r system.

source: Sand profile surveys are carried out once a year, in April or May, along the preselected transect routes. It will take roughly two to four hours depending on the length of the transect.
cy: Caiff arolygon o broffil y twyni eu cynnal unwaith y flwyddyn, ym mis Ebrill neu Mai, ar hyd y llwybrau trawslun sydd wedi'u dewis eisoes. Yn fras, bydd angen rhwng dwy a phedair awr, yn ôl hyd y trawslun.

source: Take with you:<1><0>Handheld GPS unit</0><1>Mobile phone app - transect locations downloaded beforehand</1><2>Compass</2><3>Long tape measure (ideally 50 m or more)</3><4>Ranging poles</4><5>Clinometer</5></1>
cy: Ewch â'r canlynol gyda chi:<1><0>Uned law GPS</0><1>Ap ffôn symudol - gyda'r lleoliadau trawslun wedi'u lawrlwytho ymlaen llaw</1><2>Cwmpawd</2><3>Tâp mesur hir (50 m neu'n hirach yn ddelfrydol)</3><4>Polion anelu</4><5>Clinomedr</5></1>

source: <0><0>Using your handheld GPS (and mobile phone app), navigate to the first point of the transect, which will be marked by a post. The grid reference can be found on the transect description form, or the start point described on the app.</0><1>Use the grid reference for the end of the transect and your compass (and your mobile phone app) to navigate along the transect. For transects ending at the beach, the end point will be on the beach itself.</1><2>Use the tape measure to measure the distance between survey locations.</2><3>When using the app, use the same phone to record all the data for one transect.</3></0>
cy: <0><0>Gan ddefnyddio'ch uned GPS (a'ch ap ffôn symudol), llywiwch at bwynt cyntaf y trawslun, a fydd wedi'i nodi gan bostyn. Gellir gweld y cyfeirnod grid ar y ffurflen cofnodi trawslun, neu'r pwynt cychwynnol a ddisgrifir ar yr ap.</0><1>Defnyddiwch y cyfeirnod grid ar gyfer diwedd y trawslun a'ch cwmpawd (a'ch ap ffôn symudol) i lywio ar hyd y trawslun. Yn achos trawsluniau sy'n gorffen ar y traeth, bydd y pwynt terfynol ar y traeth ei hun.</1><2>Defnyddiwch y tâp mesur i fesur y pellter rhwng lleoliadau'r arolwg.</2><3>Wrth ddefnyddio'r ap, defnyddiwch yr un ffôn i gofnodi'r holl ddata ar gyfer un trawslun.</3></0>

source: <0><0>At point 1 of the transect, person A should stand holding ranging pole 1 and the clinometer. Make sure you hold the pole straight and it does not sink into the sand. Enter the grid reference of the start point on the manual recording form. The app will do this automatically when you register the Start point.</0><1>Following the bearing of the transect (i.e. heading towards the end point), person B should take ranging pole 2 to the point at which there is a marked change in the angle of the slope of the dune, or at approximately 50 m distance if no clear change in slope (see Figure 1) - there may be long uniform areas which are beyond convenient sighting distance. At this point, place ranging pole 2 on the ground, again making sure you hold it straight and that it does not sink into the sand. Enter the grid reference of this point on the recording form. The app will automatically record the grid reference when you click to register the next survey point.</1><2></2><3>Figure 1. Illustration of how to measure the profile along a sand dune</3><br/><5>Person A should then use the clinometer to measure the angle of the slope from pole 1 to pole 2. The reading should be taken between the marking on pole 1 that is closest to person A’s eye level and the corresponding marking on pole 2 (see diagram below). Note down this angle on the recording form, or in the app.</5><6>If you find yourself going downhill as you walk along the transect, the ‘lower’ person should take the clinometer to measure the angle of the slope and it should be noted in the recording form or on the app that this was a downhill reading. Enter the angle as a negative number.</6><7>Use the tape measure to measure the distance along the ground from pole 1 to pole 2. Note this distance down on the recording form, or in the app.</7><8>Person B with pole 2 should then stay where they are and person A should continue walking along the bearing of the transect, handing the clinometer to person A as they pass them.</8><9>When they reach another distinct change in the angle of the slope of the dune, they should stop and place ranging pole 1 on the sand and the process of measuring the angle of the slope and the distance between the poles should be repeated, this time with person B taking the measurements from pole 2 to pole 1.</9><10>Repeat this process until you reach the end of the transect.</10><11>Notes:<1><0>On very loose sand on a steep dune, it may be necessary to walk a few metres away from the direct line to avoid disturbing the dune, but track back to the direct line to take the next measurement.</0><1>The end point of the transect for transects leading to the shore should be approximately 5 m seawards from the edge of the mobile dune or embryo dune zone.</1></1></11></0>
cy: <0><0>Dylai person A sefyll wrth bwynt 1 a gafael ym mholyn anelu 1 ac yn y clinomedr. Sicrhewch eich bod yn dal y polyn yn syth ac nad yw'n suddo i'r tywod. Cofnodwch gyfeirnod grid y pwynt cychwynnol ar y ffurflen cofnodi â llaw. Bydd yr ap yn gwneud hyn yn ddiofyn pan fyddwch chi'n cofnodi'r Pwynt cychwynnol.</0><1>Gan ddilyn cyfeiriant y trawslun (h.y. gan symud tuag at y pwynt terfynol), dylai person B fynd â pholyn anelu 2 hyd at y pwynt ble mae newid amlwg yn ongl llethr y twyn, neu at bellter o oddeutu 50m os nad oes newid amlwg yn y llethr (gweler Ffigur 1) - efallai y bydd mannau unffurf hir sydd y tu hwnt i bellter gweld cyfleus. Rhowch bolyn anelu 2 ar y tir yn y fan hon, eto gan sicrhau eich bod yn ei ddal yn syth ac nad yw'n suddo i'r tywod. Cofnodwch gyfeirnod grid y pwynt hwn ar y ffurflen gofnodi. Bydd yr ap yn cofnodi'r cyfeirnod grid yn ddiofyn pan fyddwch chi'n clicio i gofnodi pwynt nesaf yr arolwg.</1><2></2><3>Ffigur 1. Darlun o sut i fesur y proffil ar hyd twyn tywod</3><br/><5>Dylai person A wedyn ddefnyddio'r clinomedr i fesur ongl y llethr o bolyn 1 hyd at bolyn 2. Dylid gwneud y darlleniad rhwng y nod ar bolyn 1 sydd agosaf at lefel llygad person A a'r nod cyfatebol ar bolyn 2 (gweler y diagram isod). Nodwch yr ongl hon ar y ffurflen gofnodi, neu yn yr ap.</5><6>Os cewch eich bod yn cerdded am i lawr wrth i chi gerdded ar hyd y trawslun, dylai'r person 'isaf' fynd â'r clinomedr i fesur ongl y llethr a dylid nodi ar y ffurflen gofnodi neu ar yr ap mai darlleniad i lawr y llethr oedd hwn. Cofnodwch yr ongl fel rhif negyddol.</6><7>Defnyddiwch y tâp mesur i fesur y pellter ar hyd y ddaear rhwng polyn 1 a pholyn 2. Nodwch y pellter hwn ar y ffurflen gofnodi, neu yn yr ap.</7><8>Wedyn dylai person B aros ble mae gyda pholyn 2 a dylai person A gerdded ymlaen ar hyd cyfeiriant y trawslun, gan roi'r clinomedr i berson A wrth basio.</8><9>Pan fydd yn dod at newid amlwg arall yn ongl llethr y twyn, dylai stopio a rhoi polyn anelu 1 ar y tywod, a dylid ailadrodd y broses o fesur ongl y llethr a'r pellter rhwng y polion, y tro hwn gyda pherson B yn cymryd y mesuriadau rhwng polyn 2 a pholyn 1.</9><10>Ailadroddwch y broses hon tan fyddwch wedi cyrraedd diwedd y trawslun.</10><11>Nodiadau:<1><0>Ar dywod rhydd iawn ar dwyn serth, efallai y bydd angen cerdded rai metrau oddi wrth y llinell uniongyrchol i osgoi tarfu ar y twyn, ond ewch yn ôl at y llinell uniongyrchol i gymryd y mesuriad nesaf.</0><1>Yn achos trawsluniau sy'n arwain at y lan, dylai pwynt terfynol y trawslun fod tua 5m tuag at y môr o ymyl y parth twyni symudol neu egin-dwyni.</1></1></11></0>

source: The aim of this survey is to develop a visual record of the sand dune system using fixed point photographs. This will allow assessments to be made of how the morphology (form, shape and structure) and vegetation composition of sites are changing over time.
cy: Nod yr arolwg hwn yw datblygu cofnod gweledol o'r system twyni tywod gan ddefnyddio ffotograffau pwynt sefydlog. Bydd hyn yn caniatáu gwneud asesiadau o sut mae morffoleg (ffurf, siâp a strwythur) a chyfansoddiad llystyfiant safleoedd yn newid dros amser.

source: Fixed point photographs should be taken at least once a year, in April or May, at preselected locations.
cy: Dylid tynnu ffotograffau pwynt sefydlog unwaith y flwyddyn o leiaf, ym mis Ebrill neu Mai, yn y lleoliadau sydd wedi'u dewis eisoes.

source: Make sure you take with you:<1><0>Handheld GPS unit</0><1>(Mobile phone app – fixed point photography locations downloaded beforehand)</1><2>Compass</2></1>
cy: Ewch â'r canlynol gyda chi:<1><0>Uned law GPS</0><1>(Ap ffôn symudol – gyda'r lleoliadau ffotograffiaeth pwynt sefydlog wedi'u lawrlwytho ymlaen llaw)</1><2>Cwmpawd</2></1>

source: <0><0>Using your handheld GPS (and mobile phone app), navigate to each photography point, which will be marked by a post. The grid reference can be found on the description form for photography points, or described on the app. Some photography points may be along transects, others may be in dune slacks or other points of interest on the site.</0><1>For points that are along transects, from the starting point of the transect marked by a post, use the grid reference of the end of the transect and your compass (and your mobile phone app) to navigate along the transect.</1></0>
cy: <0><0>Gan ddefnyddio'ch uned GPS (a'ch ap ffôn symudol), llywiwch at bob pwynt ffotograff, a fydd wedi'u nodi gan bostyn. Gellir gweld y cyfeirnod grid ar y ffurflen ddisgrifio ar gyfer pwyntiau ffotograff, neu wedi'i ddisgrifio ar yr ap. Efallai y bydd rhai pwyntiau ffotograff ar hyd trawsluniau, ac eraill mewn llaciau twyni neu wrth nodweddion eraill o ddiddordeb ar y safle.</0><1>Yn achos pwyntiau sydd ar hyd trawsluniau, o bwynt cychwynnol y trawslun, sydd wedi'i nodi gan bostyn, defnyddiwch gyfeirnod grid diwedd y trawslun a'ch cwmpawd (a'ch ap ffôn symudol) i lywio ar hyd y trawslun.</1></0>

source: <0><0>Take a photograph at each photography point. It is important to take your photograph so it matches the position of the original photo (see the list of locations, or the app) so that direct comparisons can be made. To help you do this:<1><0>Each photograph should be taken in the direction indicated (as aligned with the guide photo)</0><1>Take the photograph at eye level</1><2>Refer back to the photographs shown in the transect description form, or on the app. If there are any useful reference points (e.g. trees, buildings), make sure these are in the same place in your new photograph.</2></1></0><1>For each photograph, record the time it was taken on the recording form so that it can be identified and stored correctly. This will be recorded automatically on the app.</1></0>
cy: <0><0>Tynnwch lun wrth bob pwynt ffotograff. Mae'n bwysig tynnu'r llun fel ei fod yn cyd-fynd â lleoliad y ffotograff gwreiddiol (gweler y rhestr o leoliadau, neu'r ap) er mwyn gallu cymharu'n uniongyrchol. I'ch helpu i wneud hyn:<1><0>Dylid tynnu pob llun yn y cyfeiriad a nodir (wedi'i alinio â'r llun cynorthwyol)</0><1>Tynnwch y llun ar lefel y llygad</1><2>Cyfeiriwch yn ôl at y ffotograffau a ddangosir yn y ffurflen disgrifio trawslun, neu ar yr ap. Os oes nodweddion cyfeirio defnyddiol (e.e. coed, adeiladau), sicrhewch fod y rhain yn yr un lle yn eich ffotograff newydd.</2></1></0><1>Ar gyfer pob ffotograff, cofnodwch yr amser y tynnwyd y llun ar y ffurflen gofnodi er mwyn gallu ei adnabod a'i storio yn gywir. Caiff hyn ei gofnodi'n ddiofyn ar yr ap.</1></0>

source: The aims of this survey cover three aspects:<1><0>to record the percentage cover of bare sand and the cover and height of broad vegetation types. This will allow us to examine whether the composition and structure of the vegetation at the site is changing over time.</0><1>to record the percentage cover of plant species that are positive and negative indicators of dune health (including rare species and invasive species) so we can track how the health of the sand dune system is changing over time.</1><2>to record the percentage cover of species which indicate higher nutrient levels.</2></1>
cy: Mae tair nod i'r arolwg hwn:<1><0>cofnodi canran yr arwynebedd sydd wedi'i orchuddio gan dywod noeth, ac arwynebedd ac uchder mathau cyffredinol o lystyfiant. Bydd hyn yn caniatáu i ni archwilio a yw cyfansoddiad a strwythur y llystyfiant ar y safle yn newid dros amser.</0><1>cofnodi canran yr arwynebedd sydd wedi'i orchuddio gan rywogaethau o blanhigion sy'n ddangosyddion cadarnhaol a negyddol o iechyd y twyni (gan gynnwys rhywogaethau prin a rhywogaethau ymledol) fel y gallwn olrhain sut mae iechyd system y twyni tywod yn newid dros amser.</1><2>cofnodi canran yr arwynebedd sydd wedi'i orchuddio gan rywogaethau sy'n dynodi lefelau uwch o faetholion.</2></1>

source: Finding and marking out the quadrat
cy: Canfod y cwadrad a'i farcio

source: What to record in the quadrat
cy: Beth i'w gofnodi yn y cwadrad

source: Vegetation cover
cy: Llystyfiant ar yr wyneb

source: Vegetation height
cy: Uchder y llystyfiant

source: Health indicator species and nitrogen indicator species
cy: Rhywogaethau dangosol ar gyfer iechyd a nitrogen
