Repository: NERC-CEH/dunes-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: Dense, upright flowerheads, with all flowers growing from one side. Red-tipped green, changing to orange-brown when mature. Simple, broad leaves
cy: Fflurbennau trwchus unionsyth, gyda'r holl flodau'n tyfu o un ochr. Gwyrdd a'u pennau'n goch, yn newid i orenfrown pan yn aeddfed. Dail llydan syml.

source: Open, disturbed areas on fixed dunes, and sandy shingle
cy: Mannau agored wedi'u tarfu ar dwyni sefydlog, a graean bras tywodlyd

source: Flowers greenish-yellow to pale brown, in tall, narrow stalks. Leaves broad, pointed ovals with thin stems down to base.
cy: Blodau gwyrddfelyn i frown golau, mewn coesynnau tal a main. Dail hirgrwn llydan a phigfain â choesynnau main i lawr at y bôn.

source: Regularly disturbed areas, particularly well-trodden places, as leaves are resistant to trampling
cy: Mannau sy'n cael eu tarfu'n aml, yn arbennig ble mae pobl yn cerdded, am fod y dail yn gwrthsefyll eu sathru

source: Long, thin leaves, growing in clusters of 6-8 around the stem, coated in small, sticky hooks which attach to fur or clothing. Small, dull white flowers with 4 petals, growing on stalks from the base of the leaves.
cy: Dail hir a main, yn tyfu mewn clystyrau o 6-8 o amgylch y coesyn, wedi'u gorchuddio â bachau gludiog bychain sy'n glynu wrth ffwr neu ddillad. Blodau bychain gwyn pŵl â 4 petal, yn tyfu ar goesynnau o fôn y dail.

source: Often growing alongside other plants, using them for support. Often found in hedges, or areas of scrub where the sward is higher.
cy: Yn tyfu'n aml gerllaw planhigion eraill, ac yn eu defnyddio i ddringo drostynt. I'w weld yn aml mewn gwrychoedd, neu brysgoed ble mae'r gwair yn uwch.

source: Leaves glossy, curled and cylindrical but can be unrolled. Tall and pointed. Flower spikes densely packed, golden to light brown in colour
cy: Dail sgleiniog wedi'u cyrlio fel pibelli, ond gellir eu dadrolio. Tal a phigfain. Sbigynnau'r blodau'n glos iawn, yn euraid hyd at frown eu lliw.

source: Thick tufts of marram are found on embryo dunes and areas of bare sand, where it helps to hold the dunes together
cy: Mae cudynnau trwchus o foresg i'w gweld ar egin-dwyni a mannau o dywod noeth, ble mae'n helpu i ddal y twyni at ei gilydd

source: Thin, wiry leaves, growing up to 35cm tall. Flower spikes with pale brown spikelets, carrying flowers in dense clusters
cy: Dail tenau fel gwifrau, yn tyfu hyd at 35cm o uchder. Sbigynnau blodau a chanddynt sbigolion brown golau yn cario blodau mewn clystyrau clos

source: On embryo dunes and areas of bare sand, this is an early coloniser
cy: Ar egin-dwyni a mannau o dywod noeth, mae hwn yn cytrefu'n gynnar

source: Blue flowers in globe-shaped heads with narrow petals. Somewhat scruffy looking. Leaves oblong and narrow, sometimes wavy-edged and hairy
cy: Blodau glas mewn fflurbennau crwn â phetalau main. Golwg ychydig yn anniben arnynt. Dail hirgul, a'u hymylon weithiau'n donnog a blewog.

source: Dry, grassy areas and heaths, particularly areas with sandy soil
cy: Rhosydd a mannau glaswelltog sych, yn arbennig mannau gyda phridd tywodlyd

source: Solitary, bright yellow flowerheads above purple-tipped bracts. Leaves growing in a rosette at the base, lance-like with wavy edges, blunted ends and bearing small hairs
cy: Fflurbennau unigol melyn llachar uwchben bractau â'u blaenau'n borffor. Dail â ffurf gwayw iddynt, ymylon tonnog, blew bychain, a'u blaenau'n bŵl yn tyfu mewn rhosglwm wrth fôn y planhigyn.

source: Dry grassland, wasteland and often the edges of car parks
cy: Glaswelltir sych, tir diffaith, ac ymylon meysydd parcio yn aml

source: Generally pale green in colour, they are mostly distinguished by the fruiting body cups, which are often raised above the lichen on stalks.
cy: Fel arfer yn wyrdd golau eu lliw, fe'i hadnabyddir ar y cyfan gan gwpanau'r cyrff ffrwytho, sy'n aml wedi'u codi uwchlaw'r cen ar goesynnau.

source: Trees, Rocks, Fallen branches
cy: Coed, Creigiau, Canghennau wedi cwympo

source: Palmate leaves with 5 lobes, usually 7-16cm across, slightly toothed margins. Flowers are green-yellow in colour, and hang in clusters from the end of branches.
cy: Dail palfog a chanddynt 5 llabed ac ymylon ychydig yn ddanheddog, ac sydd 7-16cm ar draws. Mae'r blodau'n felynwyrdd eu lliw, ac yn hongian mewn clystyrau o bennau'r canghennau.

source: Almost everywhere. Woodland and areas of scrub in particular
cy: Ym mhobman bron. Coetiroedd ac ardaloedd o brysgoed yn arbennig

source: Dark green, glossy, oval shaped leaves. Spiky leaves on younger trees, but these are less common on older ones. Flowers white with 4 petals, occurring in clusters.
cy: Dail hirgrwn, sgleiniog, gwyrdd tywyll. Dail pigog ar goed ifancach, ond mae'r rhain yn llai cyffredin ar y rhai hŷn. Blodau gwyn â 4 petal, i'w cael mewn clystyrau.

source: Common in woodland and areas of scrub
cy: Yn gyffredin mewn coetiroedd ac ardaloedd o brysgoed

source: Evergreen with blue-green needles, which are often slightly twisted. Needles grow in pairs. Male flowers grow as small, yellow clusters at the base of shoots, female flowers are small, reddish-purple and globe shaped, growing at the tip of shoots
cy: Planhigyn bythwyrdd a chanddo nodwyddau glaswyrdd, sydd yn aml yn troelli rywfaint. Mae'r nodwyddau'n tyfu mewn parau. Mae'r blodau gwrywaidd yn tyfu fel clystyrau melyn bychain wrth fôn y brigau, ac mae'r blodau benywaidd yn fychan, yn goch-borffor, yn grwn, ac yn tyfu ar bennau'r brigau

source: Areas of scrub or heath in particular
cy: Mannau o brysgoed neu rostir yn arbennig

source: Stubby moss, with stems up to 5cm in length, but usually shorter. Dark green to dark brown-black when dry. Leaves straight when wet, radiating out in a star shape
cy: Mwsogl cwta, a chanddo goesynnau hyd at 5cm o hyd, ond yn fyrrach fel rheol. Gwyrdd tywyll i frownddu tywyll pan mae'n sych. Y dail yn syth pan mae'n wlyb, yn ymledu ar ffurf seren

source: Pioneer species on recently disturbed ground, but will also grow on fences, rotten wood and shingle
cy: Rhywogaeth arloesol ar dir wedi'i darfu'n ddiweddar, ond mae'n tyfu hefyd ar ffensys, ar bren wedi pydru ac ar raean bras

source: Distinctive plantain with pinnate leaves growing in a rosette at the base, somewhat resembling antlers. Flower spikes yellow-brown with protruding anthers.
cy: Llyriad hawdd ei adnabod a chanddo ddail asgellog, sy'n gymharol debyg i gyrn carw, yn tyfu mewn rhosglwm wrth fôn y planhigyn. Sbigynnau'r blodau yn felynfrown a chanddynt antheri amlwg.

source: Dry, bare, sandy places, particularly frequently disturbed areas like edges of paths
cy: Mannau sych, noeth a thywodlyd, yn arbennig llefydd sy'n cael eu tarfu'n aml, fel ymylon llwybrau

source: Sharply spined thistle with deeply lobed pinnate leaves. Flowerheads lilac, 2-4cm across and quite puffy, with a spiny ball-like bracts below. Stems somewhat cottony
cy: Ysgallen bigog iawn, a chanddi ddail asgellog mewn llabedau dyfnion. Fflurbennau lelog eu lliw, 2-4cm o led ac yn eithaf chwyddog, a bractau pigog fel peli oddi tanynt. Y coesynnau ychydig yn gotymaidd

source: Disturbed ground, particularly verges and field edges, as well as waste ground.
cy: Tir wedi'i darfu, yn arbennig ymylon ffyrdd ac ymylon caeau, yn ogystal â thir diffaith

source: Thin, thorny stems. Pinnate leaves with toothed margins. Flowers often large, usually white, pink or red with large, floppy petals which detach easily.
cy: Coesynnau main a dreiniog. Dail asgellog a chanddynt ymylon danheddog. Y blodau'n fawr yn aml, fel arfer yn wyn, yn binc neu'n goch, a chanddynt betalau mawr llipa sy'n dod oddi ar y blodyn yn rhwydd.

source: Usually found in scrub or hedgerows, except Burnet rose (Rosa pimpinellifolia) which grows in open areas across heath and dunes with short grass
cy: Fe'i gwelir fel arfer mewn prysgoed neu wrychoedd, ac eithrio Rhosyn bwrned (Rosa pimpinellifolia) sy'n tyfu mewn mannau agored ar draws rhosydd a thwyni ble mae'r gwair yn fyr

source: Evergreen shrub growing to 2.5m, leaves short, firm spines, stalked towards the base. Yellow, lipped flowers growing from the base of the spines towards the end of branches, strongly coconut scented
cy: Prysglwyn bythwyrdd sy'n tyfu hyd at 2.5m, a'i ddail yn bigau caled, byr sydd ar goesynnau tua'r bôn. Blodau melyn llabedog yn tyfu o fôn y pigau tua diwedd y canghennau, ac arogl cnau coco cryf arnynt

source: Heaths and grassland, particularly ungrazed areas
cy: Rhosydd a glaswelltir, yn arbennig mannau heb eu pori

source: Carpeting heather, usually growing up to 50cm, occasionally downy in appearance. Oblong leaves in alternate rows, branching from the main stem. Flowers pale pink to mauve, growing in spikes at the end of stems.
cy: Grug sy'n gorchuddio rhannau helaeth o dir, sy'n tyfu fel rheol hyd at 50cm, a golwg felfedaidd arno o bryd i'w gilydd. Dail hirgul mewn rhesi bob yn ail, yn tyfu o'r prif goesyn. Blodau'n amrywio o binc golau i borffor golau, yn tyfu mewn sbigynnau ar bennau'r coesynnau.

source: Anywhere on dunes and heathland, except particularly wet areas, can often be found dominating large areas
cy: Unrhyw le ar dwyni a rhostir, ac eithrio mannau arbennig o wlyb, fe'i gwelir yn aml yn dominyddu ardaloedd eang

source: Short, creeping plant with lobed, pinnate leaves and deep pink, hooked burs which turn bronze coloured. Small, cream coloured flowers grow on spherical heads atop upright stalks.
cy: Planhigyn byr ymgripiol a chanddo ddail asgellog llabedog a chodennau bachog pinc tywyll sy'n troi'n lliw efydd. Mae blodau bychain hufen eu lliw yn tyfu ar fflurbennau crwn ar goesynnau unionsyth.

source: Wet slopes, dunes and grassy areas, forming a dense mat at ground level
cy: Llethrau gwlyb, twyni a mannau glaswelltog, yn ffurfio carped trwchus ar y ddaear

source: Shrub with dense, dark green, leathery, oval leaves. Blooms large, ranging from light pink to purple, with open, bell-shaped flowers of 5 petals
cy: Prysglwyn a chanddo drwch o ddail hirgrwn, gwyrdd tywyll fel lledr. Blodau mawr, agored 5 petal, ar ffurf clychau, yn amrywio o binc golau i borffor

source: Once rhododendron takes hold, little else can grow because of the dense canopy, so it is often found in areas of shrub
cy: Wedi i rododendron gydio, mae'n anodd i unrhyw beth arall dyfu, o achos y canopi trwchus, felly fe'i gwelir yn aml mewn ardaloedd o brysglwyni

source: Creeping, greeny-yellow plant with fleshy, oval leaves. Flowers with 5 petals, small and greenish-white with a yellow centre. Flowers solitary and at the end of stems
cy: Planhigyn melynwyrdd yn ymgripio, a chanddo ddail hirgrwn tew. Blodau 5 petal gwyrddwyn bychain a'u canol yn felyn. Blodau unigol ar bennau'r coesynnau

source: Areas of sand and shingle, growing low to the ground
cy: Mannau o dywod a graean bras, yn tyfu'n agos at y ddaear

source: Small, bushy plant with linear, succulent leaves with sharp, prickly tips. Solitary green flowers, above leaf-like bracts
cy: Planhigyn bychan trwchus a chanddo ddail hirfain suddlon a'u pennau'n bigfain a phigog. Blodau gwyrdd unigol uwchben bractau tebyg i ddail

source: Areas of bare sand,
cy: Mannau o dywod noeth

source: Greyish-green, hairless succulent, lobed, pinnate leaves towards the base and more linear leaves moving up the stem. Flowers with 4 petals, pale lilac to white in colour
cy: Dail asgellog llabedog, suddlon, llwydwyrdd, heb flew tua bôn y planhigyn a dail mwy hirfain yn uwch i fyny'r coesyn. Blodau lelog golau i wyn â 4 petal

source: Sandy coastal areas
cy: Mannau arfordirol tywodlyd

source: Large, trumpet shaped flowers, light pink in colour, with white stripes. Fleshy, kidney-shaped leaves, with stems creeping along the ground
cy: Blodau mawr tebyg i drympedi, pinc golau eu lliw â streipiau gwyn. Dail tew ar ffurf arennau, a choesynnau'n ymgripio ar hyd y ddaear

source: Bare, sandy areas, growing amongst marram grass
cy: Mannau noeth, tywodlyd, yn tyfu ymysg y moresg

source: Green stems and narrow, blade-like leaves. The spikelets, which hold the flowers, are attached to the stem in an alternating pattern.
cy: Coesynnau gwyrdd a dail main fel llafnau. Mae'r sbigolion, sy'n dal y blodau, wedi'u cysylltu â'r coesyn mewn patrwm bob yn ail.

source: Roadside verges, rough pastures and waste ground
cy: Ymylon ffyrdd, tir pori garw a thir diffaith

source: A deciduous bushy shrub. 1m tall – 2m wide. Narrowly-oval, densely-hairy leaves are grey-green above and silvery beneath and appear after the silvery catkins that mature to yellow in spring.
cy: Prysglwyn collddail trwchus. 1m o uchder - 2m o led. Mae'r dail hirgrwn main yn drwch o flew, yn wyrddlwyd ar eu hochr uchaf ac yn ariannaidd ar eu hochr isaf, ac yn ymddangos ar ôl y cenawon ariannaidd sy'n aeddfedu'n felyn yn y gwanwyn.

source: Sand dunes, acid grassland and heathland including coastal heaths.
cy: Twyni tywod, glaswelltir asidaidd a rhostir, gan gynnwys rhosydd arfordirol.

source: Hairy, oval, toothed leaves that appear in whorls around the reddish stems. It produces dense clusters of lilac-pink flowers at the ends of its stems.
cy: Dail danheddog, hirgrwn, blewog sy'n ymddangos mewn troellau o amgylch y coesynnau cochaidd. Mae'n cynhyrchu clystyrau clos o flodau lelog-binc ar bennau'r coesynnau.

source: Freshwater Wetlands, Towns and Gardens
cy: Gwlypdiroedd Dŵr Croyw, Trefi a Gerddi

source: Leaves are peltate, having a roughly circular shape and frequently a comparatively long petiole. The flower stems are shorter than the petioles and bare tiny, pinkish flowers
cy: Dail tarianffurf mewn siâp cylch bras, a chanddynt betiol cymharol hir yn aml. Mae coesynnau'r blodau yn fyrrach na'r petiolau ac yn cario blodau pincaidd pitw bach

source: Aquatic weed that spreads out horizontally forming dense mats in shallow water, mud, or in marshes.
cy: Chwyn dŵr sy'n ymledu'n llorweddol ac yn ffurfio carpedi trwchus mewn dŵr bas, mwd neu gorsydd.

source: Selfheal is a low-growing, perennial herb with paired, oval leaves and bluish or violet flowers that appear in dense, oblong clusters on the top of its stems. Its purple-tinged seed head remains after flowering
cy: Planhigyn llysieuol lluosflwydd sy'n tyfu'n agos at y ddaear yw'r feddyges las. Mae ganddi barau o ddail hirgrwn a blodau glas neu fioled mewn clystyrau trwchus hirgul ar ben y coesynnau. Mae gwawr borffor i'r fflurben yn ei hadau, sy'n parhau ar ôl blodeuo.

source: Short turf of grasslands, uncut grass in woodlands, roadside verges, lawns
cy: Glaswelltiroedd byr, gwair heb ei dorri mewn coetiroedd, ymylon lonydd, lawntiau

source: Bog pimpernel is low growing. The flowers are small, pink and cup-shaped with five petals. The leaves are small, rounded and in pairs along thin wiry stems.
cy: Mae gwlyddyn-Mair y gors yn tyfu'n agos at y ddaear. Mae ganddo flodau bychain pinc pum petal ar ffurf cwpan. Mae'r dail yn fach, yn grwn ac yn tyfu mewn parau ar hyd coesynnau gwifrog main.

source: Wet, open meadows and fens
cy: Gweirgloddiau a mignedd gwlyb ac agored

source: Flowers in heads; usually yellow, but can be orange, red, purple or white. Leaves pinnate with narrow leaflets, finely haired
cy: Yn blodeuo mewn fflurbennau; melyn fel rheol, ond gallant fod yn oren, coch, porffor neu wyn. Dail asgellog a deilios main â blew mân

source: Found in open grassland
cy: I'w gael mewn glaswelltir agored

source: We've sent an email to you
cy: Anfonwyd e-bost atoch

source: Clear Cache
cy: Clirio'r Storfa

source: This clears the locally cached location images.
cy: Bydd hyn yn clirio'r delweddau lleoliad sydd wedi'u storio'n lleol.

source: Cache was cleared.
cy: Cliriwyd y storfa.

source: Leaves: pinnately compound, with three to five leaflets which are elliptical in shape with rough toothed margins. Leaves grow in an opposite leaf arrangement. Flowers: white in colour, the various stamens are clearly visible and the flowers are in clusters. The flowers are around two centimetres in width. Although they appear to have four petals, they are in fact sepals. Seed clusters which have a feathered appearance and are white-grey in colour. They are called achenes. It is the fruit which gives the plant its other name: 'old man’s beard'.
cy: Dail: cyfansawdd ac asgellog, a chanddynt rhwng tri a phump o ddeilios hirgrwn eu siâp ag ymylon danheddog garw. Mae'r dail yn tyfu naill ochr i'r coesyn mewn parau. Blodau: yn wyn eu lliw ac mewn clystyrau, ac mae'r amryw frigerau yn amlwg i'r llygad. Mae'r blodau tua dau gentimetr o led. Er ei bod yn ymddangos bod pedwar petal ganddynt, sepalau ydynt mewn gwirionedd. Mae'r clystyrau o hadau yn edrych fel plu ac yn llwydwyn eu lliw. Achenau yw'r enw arnynt. O'r ffrwyth y daw'r enw ar y planhigyn: 'barf yr hen ŵr'.

source: Coastal
cy: Arfordirol

source: Hedgerow
cy: Gwrych

source: Bramble has long, thorny and arching stems and can grow up to two metres or more high,alternate and palmately compound. Each leaf is divided into three or five serrated, short-stalked, oval leaflets. Leaves are dark green on top and pale beneath. Leaf stalks and mid-ribs are prickly,clusters of white or pink flowers appear from late spring to early summer. They are 2–3cm in diameter with five petals and many stamens.
cy: Mae gan lwyni mwyar duon goesynnau hir, dreiniog fel bwâu, a gallant dyfu hyd at ddau fetr o uchder neu fwy. Mae eu dail cyfansawdd palfog, bob un wedi'i rhannu'n dri neu bump o ddeilios hirgrwn danheddog ar ddeilgoesynnau byrion, yn tyfu ar y coesyn bob yn ail. Mae'r dail yn wyrdd tywyll ar eu hochr uchaf ac yn olau ar eu hochr isaf. Mae'r deilgoesynnau a'r gwythiennau canol yn bigog. Mae clystyrau o flodau gwyn neu binc yn ymddangos rhwng diwedd y gwanwyn a dechrau'r haf. Maent rhwng 2 a 3cm o ddiamedr, ac mae ganddynt bump o betalau a nifer o frigerau.

source: Woodland, grassland
cy: Coetir, glaswelltir

source: Has yellow, tube-like flowers protruding from an inflated, green calyx. It has serrated leaves with heavy, dark veins, which sprout opposite each other all the way up the stem. Its stems have black spots.
cy: Blodau melyn fel pibelli yn gwthio allan o galycs gwyrdd chwyddedig. Mae ganddo ddail danheddog a chanddynt wythiennau tywyll trwm, sy'n tyfu gyferbyn â'i gilydd ar hyd y coesyn. Mae smotiau duon ar y coesynnau.

source: Grassland, farmland
cy: Glaswelltir, tir ffermio

source: Has oval, sharply toothed leaves, and white, violet-like flowers that have purple veins and yellow centres.
cy: Dail hirgrwn, yn amlwg ddanheddog, a blodau gwyn tebyg i'r fioled a chanddynt wythiennau porffor a chanolau melyn.

source: Grassland, Heathland and Moorland, Coastal
cy: Glaswelltir, Rhostir a Gweundir, Arfordirol

source: Small, narrow leaves that appear in whorls on its angular stems. The stems carry frothy heads of tiny, yellow flowers that appear in dense clusters.
cy: Dail main bychain sy'n ymddangos mewn troellau ar ei goesynnau onglog. Mae nifer fawr o flodau pitw bach yn tyfu ar y coesynnau mewn clystyrau clos fel ewyn melyn.

source: Grassland, heathland and moorland, farmland, coastal, towns and gardens
cy: Glaswelltir, rhostir a gweundir, tir ffermio, arfordir, trefi a gerddi

source: A large, deciduous shrub that has long, narrow, greyish leaves and small, green flowers. It has bright orange berries.
cy: Prysglwyn collddail mawr a chanddo ddail llwydaidd hirfain, a blodau bychain gwyrdd. Mae ganddo aeron oren llachar.

source: Coastal, sand dunes
cy: Arfordirol, twyni tywod

source: A common fern growing in dense stands. Large, branched fronds which appear in spring and are green when mature, but die back to brown
cy: Rhedyn cyffredin sy'n tyfu mewn clystyrau clos. Mae'r ffrondau mawr, canghennog sy'n ymddangos yn y gwanwyn yn wyrdd pan yn aeddfed, ond yn marw'n ôl i frown

source: Abundant
cy: Cyffredin iawn

source: A member of the pea family. Yellow flowers that appear in small clusters. They are followed by seed pods that look distinctly like bird's feet or claws, hence the common name. A low-growing plant, its leaves have five leaflets and are downy.
cy: Aelod o deulu'r pys. Blodau melyn sy'n ymddangos mewn clystyrau bychain. Fe'i dilynir gan godennau hadau sy'n edrych yn arbennig o debyg i grafangau neu draed adar, ac felly un o'i enwau cyffredin, Bysedd Traed y Frân. Planhigyn sy'n tyfu'n agos at y ddaear, mae pump o ddeilios gan y dail, sy'n felfedaidd.

source: Grassland, heathland, moorland, sand dunes, rocky habitat, coastal, towns and gardens
cy: Glaswelltir, rhostir, gweundir, twyni tywod, cynefinoedd creigiog, arfordir, trefi a gerddi

source: A herbaceous perennial flowering plant. 1 to 2 m (3 to 7 ft) tall in the summer and dying down to the ground in winter. Soft green leaves with strongly serrated margins and small, greenish or brownish flowers.
cy: Planhigyn blodeuol lluosflwydd llysieuol. Rhwng 1 a 2 m (3 i 7 troedfedd) o uchder yn yr haf ac yn marw nôl yn y gaeaf. Dail gwyrdd meddal a'u hymylon yn amlwg ddanheddog, a blodau bychain gwyrdd neu frownaidd.

source: A relatively tall-growing plant that has clusters of yellow, flattened flower heads, and leaves that are very divided.
cy: Planhigyn cymharol dal a chanddo glystyrau o fflurbennau melyn penfflat, a dail arbennig o ranedig.

source: Rounded, blue flower heads. It has silvery-blue leaves with many prickly spikes on their edges.
cy: Fflurbennau glas crwn. Mae ganddo ddail glas ariannaidd a chanddynt nifer o bigau main iawn ar eu hymylon.

source: Very thin leaves, rolling in at the margins, growing up to 40cm tall. Straw coloured when mature. Erect flowerheads with flowers along one side, giving a bushy appearance
cy: Dail main iawn, yn rholio i mewn ar yr ymylon ac yn tyfu hyd at 40cm o uchder. Lliw tebyg i wellt pan fyddant yn aeddfed. Fflurbennau talsyth a'r blodau ar hyd un ymyl yn gwneud iddynt ymddangos yn drwchus

source: Dry areas, particularly banks, gravelly areas, walls and dry heath
cy: Ardaloedd sych, yn arbennig llethrau, ardaloedd graeanog, waliau a rhosydd sych

source: Bluish-green shiny moss, growing in dense mats up to 10cm tall. Leaves narrow, light green but tipped with red. Leaves radiating from central stem in a star shape
cy: Mwsogl sgleiniog glaswyrdd, yn tyfu mewn matiau trwchus hyd at 10cm o uchder. Dail main, gwyrdd golau, ond â'u pennau'n goch. Y dail yn ymdroelli o'r coesyn canol ar ffurf seren

source: Dry, acidic soil on heaths, and on rocks & walls
cy: Pridd asidaidd sych ar rosydd, ac ar greigiau a waliau

source: Variable flowering time - early spring to early summer, depending on yearly temperatures
cy: Amrywio o ran adeg blodeuo - dechrau'r gwanwyn hyd at ddechrau'r haf, yn dibynnu ar y tymheredd drwy'r flwyddyn

source: Phenology
cy: Ffenoleg

source: Flowering
cy: Adeg blodeuo

source: July - September
cy: Gorffennaf - Medi

source: Pink flowers are out in June and July
cy: Mae'r blodau pinc i'w gweld ym mis Mehefin a Gorffennaf

source: June - September
cy: Mehefin - Medi

source: May - July
cy: Mai - Gorffennaf

source: All year
cy: Drwy'r flwyddyn

source: April - June
cy: Ebrill - Mehefin

source: May-September
cy: Mai - Medi

source: June - October
cy: Mehefin - Hydref

source: May - June
cy: Mai - Mehefin

source: All year round
cy: Drwy'r flwyddyn

source: May - October
cy: Mai - Hydref

source: May - September
cy: Mai - Medi

source: July - October
cy: Gorffennaf - Hydref

source: Late April - June
cy: Diwedd Ebrill - Mehefin

source: January - June
cy: Ionawr - Mehefin

source: April - September, although May - July best
cy: Ebrill - Medi, ond ar ei orau Mai - Gorffennaf

source: May - August
cy: Mai - Awst

source: Mostly July - September
cy: Fel arfer Gorffennaf - Medi

source: April - August
cy: Ebrill - Awst

source: April - May
cy: Ebrill - Mai

source: All year (Can’t find flowering time)
cy: Drwy'r flwyddyn (Methu canfod yr amser blodeuo)

source: January - December
cy: Ionawr - Rhagfyr
