Repository: NERC-CEH/dunes-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: Note the total percentage cover within the quadrat of:<1><0>Bare ground/sand</0><1>Mosses and lichens (see species guide).</1><2>Grasses, sedges and rushes. These are all plants that are grass-like in appearance. The stems of sedges generally have three edges whereas rushes have very rounded stems that are filled with pith.</2><3>Herbs. These are all other plants which are not trees or shrubs (but includes things like bramble, bracken and other ferns).</3><4>Heathland shrubs (heather, gorse, bilberry)</4><5>Trees and scrub (including young plants)</5></1>Estimates should be made by looking from above at the vegetation cover. It may help to try to imagine all of the different patches of a single vegetation type clustered together and how much of the 2 × 2 m square this would take up. Keep in mind that:<3><0>20 × 20 cm is 1 % cover</0><1>50 × 50 cm is 6.25 % cover</1><2>1 × 1 m is 25 % cover</2></3>Looking at the tape measure surrounding the quadrat may help here.<br/>If there are multiple people in your surveying team, each person should come up with an estimated percentage cover for each vegetation type separately and then the average of these estimates should be recorded on the quadrat recording form.<br/>If the cover of a single vegetation type is less than 1 % then record this as 0.5 %<br/>The total vegetation cover may exceed 100 % because different layers of vegetation may be overlapping but combined cover of vegetation and bare ground/sand should reach at least 100 % otherwise an error has been made. The app will automatically calculate the total cover.
cy: Nodwch gyfanswm canran yr arwynebedd o fewn y cwadrad sydd wedi'i orchuddio gan:<1><0>Dir neu dywod noeth</0><1>Mwsogl a chen (gweler y canllaw i rywogaethau).</1><2>Gwair, hesg a brwyn. Mae'r rhain i gyd yn blanhigion sy'n edrych yn debyg i wair. Ar y cyfan mae gan goesynnau hesg dair ymyl, ac mae coesynnau brwyn yn grwn iawn â bywyn ('pith') y tu mewn iddynt.</2><3>Planhigion llysieuol. Golygir gan hyn yr holl blanhigion eraill nad ydynt yn goed nac yn brysglwyni (ond maent yn cynnwys planhigion fel llwyni mwyar duon a rhedyn).</3><4>Prysglwyni rhostir (grug, eithin, llus)</4><5>Coed a phrysgoed (gan gynnwys planhigion ifanc)</5></1>Dylid amcangyfrif gan edrych o uwchlaw ar y llystyfiant sydd ar yr wyneb. Gall helpu i geisio dychmygu'r holl wahanol fannau sydd wedi'u gorchuddio gan un math o lystyfiant yn tyfu gyda'i gilydd a faint o'r sgwâr 2 × 2 m y byddai hyn yn ei orchuddio. Cofiwch fod:<3><0>20 × 20 cm yn 1 % o'r arwynebedd</0><1>50 × 50 cm yn 6.25 % o'r arwynebedd</1><2>1 × 1 m yn 25 % o'r arwynebedd</2></3>Gall edrych ar y tâp mesur o amgylch y cwadrad helpu gyda hyn.<br/>Os oes nifer o bobl yn eich tîm arolygu, dylai pob person amcangyfrif drosto ei hun pa ganran sydd wedi'i orchuddio gan bob math o lystyfiant ac wedyn dylid cofnodi cyfartaledd yr amcangyfrifon hyn ar ffurflen gofnodi'r cwadrad.<br/>Os yw un math o lystyfiant yn gorchuddio llai nag 1 % o'r arwynebedd, cofnodwch hyn fel 0.5 %<br/>Mae'n bosibl y bydd cyfanswm y llystyfiant yn dod i fwy na 100 % o'r arwynebedd oherwydd gall fod gwahanol haenau o lystyfiant yn croesi, ond gyda'i gilydd dylai cyfanswm yr arwynebedd sydd wedi'i orchuddio gan lystyfiant a thir neu dywod noeth ddod i 100 % o leiaf, fel arall mae gwall wedi'i wneud. Bydd yr ap yn cyfrifo cyfanswm yr arwynebedd sydd wedi'i orchuddio yn ddiofyn.

source: Considering all areas with vegetation in the quadrat, take five measurements of the height of the vegetation (ideally one in each quarter of the quadrat and one in the middle). Measure the height with a ruler or tape measure (or a drop disc if you have one), recording the height that most of the vegetation reaches within roughly 20 cm of your ruler – ignore occasional tall flowering stems if they rise above this height. If there are multiple people in your surveying team, it is useful for two or three to agree the height that should be recorded in each location. Record all five height measurements on your form, or on the app. The app will automatically calculate the average.
cy: Gan ystyried pob man yn y cwadrad ble mae llystyfiant, gwnewch bum mesuriad o uchder y llystyfiant (yn ddelfrydol un ym mhob chwarter o'r cwadrad ac un yn y canol). Mesurwch yr uchder gyda phren mesur neu dâp mesur (neu ddisg gollwng os oes un ar gael), gan gofnodi'r uchder y mae'r rhan fwyaf o'r llystyfiant yn ei gyrraedd o fewn 20 cm yn fras i'ch mesurydd – anwybyddwch fflurbennau tal achlysurol os byddant yn tyfu'n uwch na'r uchder hwn. Os oes nifer o bobl yn eich tîm arolygu, mae'n ddefnyddiol i ddau neu dri gytuno ar yr uchder y dylid ei gofnodi ym mhob safle. Cofnodwch y pum mesur o uchder ar eich ffurflen, neu yn yr ap. Bydd yr ap yn cyfrifo'r cyfartaledd yn ddiofyn.

source: Using the species list of positive and negative plant indicators for the site, for each species that you see in the quadrat, record its name on the quadrat recording form, or select it in the app. Note that there are separate lists for each habitat so make sure you use the appropriate one for the quadrat you are surveying. Estimate the percentage cover of each species.<br/>Repeat this process for the nitrogen indicator species (for fixed dune grassland and dune slack habitats) Estimates should be made by looking from above at the vegetation cover. It may help to imagine all of the different patches of a single vegetation type clustered together and how much of the 2 × 2 m square this would take up. Keep in mind that:<3><0>20 × 20 cm is 1 % cover</0><1>50 × 50 cm is 6.25 % cover</1><2>1 × 1 m is 25 % cover</2></3><br/>Looking at the tape measure surrounding the quadrat may help here.<br/>If there are multiple people in your surveying team, each person should come up with an estimated percentage cover for each vegetation type separately and then the average of these estimates should be recorded on the quadrat recording form, or in the app.<br/>If the cover of a single vegetation type is less than 1 % then record this as 0.5 % on the quadrat recording form.
cy: Gan ddefnyddio'r rhestr o rywogaethau sy'n ddangosyddion cadarnhaol a negyddol ar gyfer y safle, yn achos pob rhywogaeth a welwch yn y cwadrad cofnodwch ei henw ar ffurflen gofnodi'r cwadrad, neu ei ddewis yn yr ap. Nodwch fod rhestrau gwahanol ar gyfer pob cynefin, felly sicrhewch eich bod yn defnyddio'r un briodol ar gyfer y cwadrad rydych yn gwneud yr arolwg ohono. Amcangyfrifwch ganran yr arwynebedd sydd wedi'i orchuddio gan bob rhywogaeth.<br/>Ailadroddwch y broses hon ar gyfer y rhywogaethau dangosol ar gyfer nitrogen (yn achos glaswelltir twyni sefydlog a llaciau twyni). Dylid gwneud yr amcangyfrifon gan edrych o uwchlaw ar y llystyfiant ar yr wyneb. Gall helpu i geisio dychmygu'r holl wahanol fannau o un math o lystyfiant yn tyfu gyda'i gilydd a faint o'r sgwâr 2 × 2 m y byddai hyn yn ei orchuddio. Cofiwch fod:<3><0>20 × 20 cm yn 1 % o'r arwynebedd</0><1>50 × 50 cm yn 6.25 % o'r arwynebedd</1><2>1 × 1 m yn 25 % o'r arwynebedd</2></3><br/>Gall edrych ar y tâp mesur o amgylch y cwadrad helpu gyda hyn.<br/>Os oes nifer o bobl yn eich tîm arolygu, dylai pob person amcangyfrif drosto ei hun pa ganran sydd wedi'i orchuddio gan bob math o lystyfiant ac wedyn dylid cofnodi cyfartaledd yr amcangyfrifon hyn ar ffurflen gofnodi'r cwadrad, neu yn yr ap.<br/>Os yw un math o lystyfiant yn gorchuddio llai nag 1 % o'r arwynebedd, cofnodwch hyn fel 0.5 % ar ffurflen gofnodi'r cwadrad.

source: Make sure you take with you:<1><0>Handheld GPS unit</0><1>(Mobile phone app – fixed point photography locations downloaded beforehand)</1><2>Compass</2><3>Long tape measure (more than 10 metre)</3><4>Ruler (1 metre, or short tape measure</4><5>4 marking canes</5></1>
cy: Ewch â'r canlynol gyda chi:<1><0>Uned law GPS</0><1>(Ap ffôn symudol – gyda'r lleoliadau ffotograffiaeth pwynt sefydlog wedi'u lawrlwytho ymlaen llaw)</1><2>Cwmpawd</2><3>Tâp mesur hir (dros 10 metr)</3><4>Pren mesur (1 metr) neu dâp mesur byr</4><5>4 ffon farcio</5></1>

source: Vegetation surveys should take place once a year, in June, July or August, at pre-set quadrat locations. It will take roughly 30-45 minutes to complete a survey in a single quadrat.
cy: Dylid cynnal arolygon o'r llystyfiant unwaith y flwyddyn, ym mis Mehefin, Gorffennaf neu Awst, mewn lleoliadau cwadrad sydd wedi'u pennu eisoes. Bydd angen tua 30-45 munud i wneud arolwg mewn un cwadrad.

source: <0><0>Using your handheld GPS (and mobile phone app), navigate to the grid reference of the quadrat you intend to survey. This will be marked by a post in all habitats except for mobile dunes. The grid reference and the habitat it is located in can be found on the description form for quadrats, or described on the app.</0><1>Where the quadrat has a marker post, use your tape measure and compass to measure 2 m due north and then place one of your marking canes in the ground at this point; this will be the south west corner of the quadrat.</1><2>If it is a mobile dune quadrat, place one of your marking canes at the point of the grid reference you were provided with; this will be south west corner of the quadrat.</2><3>Then, using your compass, find due north and, using the tape measure, measure 2 m in this direction. Mark this point using a second marking cane.</3><4>Repeat this process moving east, south then west until you have marked out a 2 m by 2 m square.</4><5>You can keep the tape measure wrapped around the outside of the canes to help you define what is inside and what is outside of the quadrat.</5></0>Notes:<2><0>The marker post is positioned 2 m away from the quadrat itself to avoid disturbance in the quadrat e.g. from livestock using it as a scratching post or birds perching on it.</0></2>
cy: <0><0>Gan ddefnyddio'ch uned GPS (a'r ap ar eich ffôn symudol), llywiwch at gyfeirnod grid y cwadrad rydych yn bwriadu gwneud yr arolwg ohono. Bydd hwn wedi'i nodi gan bostyn ym mhob cynefin ac eithrio twyni symudol. Gellir gweld y cyfeirnod grid a'r cynefin y mae wedi'i leoli ynddo ar y ffurflen ddisgrifio ar gyfer cwadradau, neu mae wedi'i ddisgrifio yn yr ap.</0><1>Os oes postyn marcio yn y cwadrad, defnyddiwch eich tâp mesur a'ch cwmpawd i fesur 2 m i'r gogledd ac yna rhowch un o'ch ffyn marcio yn y ddaear yn y man hwn; dyma fydd cornel dde-orllewinol y cwadrad.</1><2>Os yw'r cwadrad mewn twyn symudol, rhowch un o'ch ffyn marcio yn lleoliad y cyfeirnod grid a gawsoch; dyma fydd cornel dde-orllewinol y cwadrad.</2><3>Yna, gan ddefnyddio'ch cwmpawd, nodwch ble mae'r gogledd a chan ddefnyddio'r tâp mesur, mesurwch 2 m i'r cyfeiriad hwn. Nodwch y man hwn gan ddefnyddio ffon farcio arall.</3><4>Ailadroddwch y broses hon gan symud i'r dwyrain, i'r de ac yna i'r gorllewin tan i chi farcio sgwâr sy'n mesur 2 m gyda 2 m.</4><5>Gallwch gadw'r tâp mesur wedi'i lapio o amgylch tu allan y ffyn i'ch helpu i ddiffinio beth sydd y tu mewn a'r tu allan i'r cwadrad.</5></0>Nodiadau:<2><0>Mae'r postyn marcio wedi'i leoli 2 m oddi wrth y cwadrad ei hun er mwyn osgoi tarfiadau o fewn y cwadrad, e.e. gan dda byw yn ei ddefnyddio fel postyn crafu neu adar yn clwydo arno.</0></2>

source: The aim of this survey is to monitor water table depth in dune slacks (seasonal wetlands) within the sand dune system. Water table depth influences the type and health of dune slack vegetation and on species present like natterjack toads and many insects that also use dune slacks or damp sand.
cy: Nod yr arolwg hwn yw monitro lefel trwythiad mewn llaciau twyni (gwlypdiroedd tymhorol) o fewn y system twyni tywod. Mae lefel trwythiad yn dylanwadu ar y math o lystyfiant sy'n tyfu mewn llaciau ac ar iechyd y llystyfiant hwnnw. Mae hefyd yn effeithio ar y rhywogaethau o anifeiliaid sydd i'w cael yno, fel llyffant y twyni a nifer o bryfed sydd hefyd yn defnyddio'r llaciau neu dywod llaith.

source: Navigating to the dipwell locations
cy: Llywio at leoliadau'r pibelli trochi

source: Water levels should be measured at least once per month at preselected dipwell locations.
cy: Dylid mesur lefelau'r dŵr unwaith y mis o leiaf yn y lleoliadau sydd wedi'u dewis eisoes ar gyfer pibelli trochi.

source: Take with you:<1><0>Handheld GPS unit</0><1>Mobile phone app - transect locations downloaded beforehand</1><2>Water-level measuring device (see notes)</2></1>
cy: Ewch â'r canlynol gyda chi:<1><0>Uned law GPS</0><1>Ap ffôn symudol – gyda'r lleoliadau trawslun wedi'u lawrlwytho ymlaen llaw</1><2>Dyfais i fesur lefel y dŵr (gweler y nodiadau)</2></1>

source: Using your handheld GPS (and mobile phone app), navigate to each dipwell. The grid reference can be found on the description form for dipwell locations, or described on the app.
cy: Gan ddefnyddio'ch uned GPS (a'ch ap ffôn symudol), llywiwch at bob pibell drochi. Gellir gweld y cyfeirnod grid ar y ffurflen ddisgrifio ar gyfer lleoliadau pibelli trochi, neu wedi'i ddisgrifio ar yr ap.

source: <0><0>If there is a cap on the dipwell, unscrew it or prise it off (depending on the type).</0><1>If there is a datalogger suspended on a wire, carefully pull it out (When you have finished measuring the water level, slowly lower the logger back down the dipwell. DON’T drop it as this can cause the logger to malfunction).</1><2>Using an appropriate water-level measuring device, measure from the top of the dipwell down to the water level.</2><3>Record the value to the nearest cm. If the slack is flooded and the water level is above the dipwell, again measure to the top of the dipwell, but record this as a negative number. Note down the water level on the form, or on the app.</3><4>Take a photograph of the dipwell, aligning it to the photograph on the dipwell information sheet, or on the app.</4></0>
cy: <0><0>Os oes cap ar y bibell trochi, dadsgriwiwch y cap neu ei wthio gyda'ch bawd (yn dibynnu ar y math).</0><1>Os oes cofnodydd data ar wifren, tynnwch hwn allan yn ofalus. (Ar ôl gorffen mesur lefel y dŵr, yn araf bach gostyngwch y cofnodydd yn ôl i lawr y bibell drochi. PEIDIWCH â'i ollwng - gall hyn beri i'r cofnodydd beidio â gweithio).</1><2>Gan ddefnyddio dyfais briodol i fesur lefel y dŵr, mesurwch o ben y bibell drochi hyd at lefel y dŵr.</2><3>Cofnodwch y gwerth hyd at y cm agosaf. Os yw'r llac wedi llenwi â dŵr a bod lefel y dŵr yn uwch na'r bibell drochi, eto mesurwch hyd at ben y bibell drochi, ond cofnodwch hyn fel rhif negyddol. Nodwch lefel y dŵr ar y ffurflen, neu ar yr ap.</3><4>Tynnwch lun o'r bibell drochi, gan ei alinio gyda'r ffotograff ar y daflen wybodaeth ar bibelli trochi, neu ar yr ap.</4></0>

source: The aim of this survey is to monitor signs of disturbance, damage or other aspects around the site. Disturbance can be considered good or bad depending on what is happening and where. For example, some disturbance can be useful to maintain areas of bare sand. It covers disturbance by animals and from human activities.
cy: Nod yr arolwg hwn yw monitro arwyddion o darfu, difrod neu agweddau eraill o amgylch y safle. Gall tarfiadau gael eu hystyried yn dda neu'n ddrwg, yn dibynnu ar beth sy'n digwydd a ble. Er enghraifft, gall peth tarfu fod yn ddefnyddiol er mwyn cynnal ardaloedd o dywod noeth. Mae'n cwmpasu tarfu gan anifeiliaid a gweithgareddau pobl.

source: Navigating to locations
cy: Llywio at y lleoliadau

source: Disturbance can be recorded at any time, anywhere on the site.
cy: Gellir cofnodi tarfiad unrhyw bryd, unrhyw le ar y safle.

source: Take with you:<1><0>Handheld GPS unit</0><1>Mobile phone app - transect locations downloaded beforehand</1></1>
cy: Ewch â'r canlynol gyda chi:<1><0>Uned law GPS</0><1>Ap ffôn symudol – gyda'r lleoliadau trawslun wedi'u lawrlwytho ymlaen llaw</1></1>

source: There are no pre-set locations, but you may want to visit particular areas to follow up previous reports of disturbance or points of interest. These can be obtained by discussing with the site manager.
cy: Nid oes lleoliadau wedi'u pennu eisoes, ond efallai yr hoffech ymweld ag ardaloedd penodol i olrhain adroddiadau blaenorol o darfiadau neu bwyntiau o ddiddordeb. Gellir cael y rhain drwy drafod gyda'r rheolwr safle.

source: If you wish to record some disturbance or other feature on the site, use the recording form, or the app activity. This covers the following aspects:<1><0>The presence and size of patches of bare sand, or where the turf has been broken up by activity of animals or people.</0><1>Presence of animal dung, and if possible an indication of which animal it is from (rabbits, ponies, cattle, sheep, other).</1><2>Rabbit activity (small feeding scrapes, burrows).</2><3>Human activities such as damage from vehicle tracks (including motorbikes), litter or flytipping. Recording litter is not aimed at the occasional sweet wrapper, but things like remains of a barbeque, multiple cans/bottles left by visitors, large rubbish items like car tyres, etc. should be recorded.</3><4>Any other aspects can be recorded using the ‘Other’ section on the form or on the app.</4></1>Please also take a photo if you can.
cy: Os hoffech gofnodi tarfiad neu nodwedd arall ar y safle, defnyddiwch y ffurflen gofnodi, neu'r gweithgaredd yn yr ap. Mae hyn yn cwmpasu'r agweddau canlynol:<1><0>Presenoldeb a maint mannau o dywod noeth, neu ble mae toriadau yn y glaswellt yn sgil gweithgarwch anifeiliaid neu bobl.</0><1>Presenoldeb baw anifeiliaid, ac os yn bosibl, syniad o ba anifail mae'n dod (cwningen, merlyn, buwch, dafad, arall).</1><2>Gweithgarwch cwningod (mannau bychain wedi'u sgrafellu wrth fwydo, tyllau cwningod).</2><3>Gweithgarwch bobl, fel difrod gan olion cerbydau (yn cynnwys beiciau modur), sbwriel neu dipio. Nid oes angen cofnodi pob un papur losin, ond yn hytrach dylid cofnodi achosion fel gweddillion barbeciw, llawer o ganiau/poteli wedi'u gadael gan ymwelwyr, eitemau mawr o sbwriel fel teiars ceir, ayb.</3><4>Gellir cofnodi unrhyw agweddau eraill gan ddefnyddio'r adran 'Arall' ar y ffurflen neu yn yr ap.</4></1>Tynnwch lun hefyd os gallwch.

source: Please specify the % of the cover.
cy: Nodwch % yr arwynebedd sydd wedi'i orchuddio.

source: This record has been uploaded and cannot be updated.
cy: Mae'r cofnod hwn wedi'i gyflwyno ac ni ellir ei ddiweddaru.

source: There are no species available for this habitat.
cy: Does dim un rhywogaeth ar gael ar gyfer y cynefin hwn.

source: No user session refresh token was found
cy: Dim tocyn adnewyddu sesiwn defnyddiwr wedi'i ganfod

source: No image available for this location.
cy: Does dim delwedd ar gael ar gyfer y lleoliad hwn.

source: Flowers blue, on thin stalks in loose clusters. 5 petals. Lowest leaves roundish with a few teeth, upper leaves narrow, untoothed and unstalked
cy: Blodau glas ar goesynnau main mewn clystyrau tenau. 5 petal. Y dail isaf yn lled grwn ac ychydig yn ddanheddog. Y dail uchaf yn fain, ddim yn ddanheddog a heb goesynnau.

source: Found in short, grazed grassland
cy: I'w weld mewn glaswelltir byr wedi'i bori

source: Found on dry, bare places, usually rock
cy: I'w weld mewn mannau sych a noeth, creigiau fel arfer

source: Flowers dark blue-purple, sometimes pink, in rounded heads. Leaves elliptical, untoothed and often stalked
cy: Blodau glas tywyll i borffor, neu'n binc weithiau, mewn fflurbennau crwn. Dail hirgrwn, heb ddannedd, ac â choesynnau yn aml

source: Flowers whitish or pale pink, flower heads stalked and egg-shaped, distinctively covered in hairs. Trefoil leaves, narrow, oval leaflets with short hairs
cy: Y blodau'n wynnaidd neu'n binc golau, a'r fflurbennau siâp wy yn goesog ac wedi'u gorchuddio gan flew. Dail triphlyg gyda deilios hirgrwn main a blew byr.

source: Tufted, triangular flowerhead made of clumps of flowers. Mostly green, with purple-red ends. Leaves grey-green.
cy: Fflurbennau cudynnog trionglog, wedi'u ffurfio o glystyrau o flodau. Yn wyrdd gan fwyaf, a'u pennau'n goch porffor. Dail llwydwyrdd.

source: Flowers yellow, 5 petals, at the end of stems. Leaves pinnate, toothed and often silvery in colour.
cy: Blodau melyn, a chanddynt 5 petal, ar bennau'r coesynnau. Dail asgellog danheddog, yn aml yn ariannaidd eu lliw.

source: Flower white, in globe-shaped heads, occasionally pale pink. Trefoil leaves with rounded leaflets, often with white markings
cy: Blodyn gwyn, weithiau'n binc, mewn fflurbennau crwn. Dail triphlyg â deilios crwn a marciau gwyn yn aml

source: Flower heads dense, flowers green to red in colour. Leaves long and narrow, with strongly waved margins. Often pointed.
cy: Fflurbennau clos, blodau gwyrdd i goch eu lliw. Dail hir a main, a'u hymylon yn amlwg donnog. Pigfain yn aml.

source: Often on disturbed ground or near water, although can be found almost anywhere. Grows up to 1m tall
cy: Yn aml ar dir wedi'i darfu neu yn agos at ddŵr, ond fe'i gwelir ym mhobman bron. Tyfu hyd at 1m o uchder

source: Grassy areas and wasteland, cultivated ground, grows up to 1.2m
cy: Mannau glaswelltog a thir diffaith, tir âr, yn tyfu hyd at 1.2m

source: Flowers bright yellow, 5 petals and star-shaped, found singularly at the end of stalks. Leaves cylindrical, reddish to green.
cy: Blodau 5 petal melyn llachar ar ffurf seren yn tyfu'n unigol ar bennau'r coesynnau. Dail cochaidd neu wyrdd fel pibelli bychain.

source: Damp, grassy places like dune slacks
cy: Mannau llaith a glaswelltog fel llaciau twyni

source: Dry grassland and sandy soils
cy: Glaswelltir sych a phridd tywodlyd

source: Grassland. Grows up to 140cm tall
cy: Glaswelltir. Yn tyfu hyd at 140cm o uchder

source: Creeping along the ground, often in trampled disturbed ground and damp areas
cy: Yn ymgripio ar hyd y ddaear, yn aml mewn tir wedi'i sathru a'i darfu a mannau llaith

source: Common on all grassland, growing low to the ground. Favoured flower of bees
cy: Yn gyffredin ar bob glaswelltir, yn tyfu'n agos at y ddaear. Y blodyn yn ffefryn gan y gwenyn

source: Lilac flowers, in clusters, flowerheads sometimes branched. Bracts purpleish in colour. Leaves pinnately lobed, sometimes cottony on the underside, stems spineless.
cy: Blodau lelog mewn clystyrau, a'r fflurbennau weithiau'n ganghennog. Bractau porfforaidd eu lliw. Dail llabedog asgellog, weithiau'n gotymaidd oddi tanynt, a'r coesynnau heb bigau.

source: Flowerheds yellow and clustered. Leaves long and pinnately lobed with soft, spiny margins.
cy: Fflurbennau melyn mewn clystyrau. Dail hir, llabedog asgellog, a'u hymylon yn feddal a phigog.

source: Early coloniser of bare & waste ground, found in areas of bare sand. Marsh sow-thistle found in marshes & ditches.
cy: Yn ymledu'n gynnar i dir noeth a diffaith, mae i'w weld mewn mannau o dywod noeth. Llaethysgallen y gors i'w gweld mewn corsydd a ffosydd.

source: Slender grass, up to 30cm tall. Bristle-like grey-green leaves.
cy: Gwair main, hyd at 30cm o uchder. Dail llwydwyrdd gwrychog.

source: Frequently on bare, dry ground as well as rocky outcrops
cy: Yn aml ar dir noeth a sych, yn ogystal â cherrig brig

source: White-tinged red flowerheads, which can also appear yellow. Star-like flowers in clusters at top of plant. Leaves small and pointed, held close to the stem, and with silvery hairs.
cy: Fflurbennau coch â gwawr wen, sydd hefyd yn gallu ymddangos yn felyn. Blodau ar ffurf sêr mewn clystyrau ar ben y planhigyn. Dail bychain, pigfain â blew ariannaidd, yn tyfu'n agos at y coesyn.

source: Open, sandy or gravelly areas
cy: Mannau agored, tywodlyd neu raeanog.

source: Short, tuft-forming rush. Grass-like leaves, fringed with long, white hairs. Flowers brown, forming rounded clusters towards the top of stems
cy: Brwyn byr sy'n ffurfio cudynnau. Dail tebyg i wair, â blew hir gwyn ar yr ymylon. Blodau brown, yn ffurfio clystyrau crwn tua phennau'r coesynnau.

source: Grassy areas, growing up to 25cm tall
cy: Mannau glaswelltog, yn tyfu hyd at 25cm o uchder
