Repository: NERC-CEH/dunes-app
Catalog: src/common/translations/interface/*.po
Languages: cy

source: Find out how to conduct each of the activities that you can complete using this app.
cy: Dysgwch sut i gynnal pob un o'r gweithgareddau y gallwch eu cwblhau drwy ddefnyddio'r ap hwn.

source: Explore some of the plant species that live in a sand dune habitat. Click on each plant for more details and to see where you might find them
cy: Archwiliwch rai o'r rhywogaethau o blanhigion sy'n byw yng nghynefinoedd y twyni tywod. Cliciwch ar y planhigion am ragor o fanylion ac i weld ble y gallwch eu gweld

source: Sand dune systems are made up of different habitats, which different animal and plant species are adapted to live in. Click on each habitat type to learn for more.
cy: Mae systemau twyni tywod yn cwmpasu gwahanol gynefinoedd, y mae gwahanol rywogaethau o anifeiliaid a phlanhigion wedi addasu i fyw ynddynt. Cliciwch ar y mathau o gynefinoedd i ddysgu mwy.

source: Welcome!
cy: Croeso!

source: Welcome to the Dynamic Dunescapes app, a tool for recording sand dune species and habitat data that helps us to understand the health of dune habitats.
cy: Croeso i ap Twyni ar Symud, offeryn ar gyfer cofnodi data am rywogaethau a chynefinoedd y twyni tywod, sy'n ein helpu i ddeall iechyd cynefinoedd y twyni.

source: Register your new account so that you can save and send us your survey data.
cy: Cofrestrwch eich cyfrif newydd er mwyn arbed data eich arolwg a'i anfon atom.

source: Choose your activity
cy: Dewiswch eich gweithgaredd

source: From fixed point photography to measuring the water table depth or recording the plant species, find out how to complete our surveys.
cy: O ffotograffiaeth pwynt sefydlog i fesur lefel trwythiad neu gofnodi'r rhywogaethau o anifeiliaid, dysgwch sut i gynnal ein harolygon.

source: Learn about dune species and habitats
cy: Dysgwch am rywogaethau a chynefinoedd y twyni tywod

source: Using the buttons at the bottom, explore the different sand dune habitats and get help ID-ing some of the plant species that live there.
cy: Gan ddefnyddio'r botymau ar y gwaelod, archwiliwch y gwahanol gynefinoedd sydd i'w cael mewn twyni tywod a chael help i adnabod rhai o'r rhywogaethau o blanhigion sy'n byw ynddynt.

source: Start your survey
cy: Dechreuwch eich arolwg

source: Click on the<1></1>button to begin your survey, easily record your findings and upload the results.
cy: Cliciwch ar y<1></1>botwm i ddechrau eich arolwg, i gofnodi'ch canfyddiadau'n rhwydd ac i gyflwyno'r canlyniadau.

source: Activities you can do
cy: Gweithgareddau y gallwch eu gwneud

source: Press the<1></1> button to start your survey
cy: Pwyswch y<1></1> botwm i ddechrau eich arolwg

source: Dune slack nitrogen loving
cy: Yn tyfu yn llaciau'r twyni ac yn hoff o nitrogen

source: Nitrogen sensitive
cy: Yn sensitif i nitrogen

source: Nitrogen loving
cy: Hoff o nitrogen

source: Acidic dune nitrogen sensitives
cy: Yn byw mewn twyni asidaidd ac yn sensitif i nitrogen

source: Acidic dune nitrogen-loving
cy: Yn byw mewn twyni asidaidd ac yn hoff o nitrogen

source: Health positive indicators
cy: Dangosyddion cadarnhaol ar gyfer iechyd

source: Health negative indicators
cy: Dangosyddion negyddol ar gyfer iechyd

source: Fixed dune acidic grassland positive indicators
cy: Dangosyddion cadarnhaol o laswelltir asidaidd mewn twyni sefydlog

source: Fixed dune acidic grassland negative indicators
cy: Dangosyddion negyddol o laswelltir asidaidd mewn twyni sefydlog

source: Mobile dune acidic grassland positive indicators
cy: Dangosyddion cadarnhaol o laswelltir asidaidd mewn twyni symudol

source: Mobile Dune Negative Indicators
cy: Dangosyddion Negyddol o Dwyni Symudol

source: Dune Slack Species
cy: Un o rywogaethau llaciau'r twyni

source: Mobile dune positive indicator
cy: Dangosydd cadarnhaol o dwyni symudol

source: Mobile dune negative indicator & Dune slacks negative indicator
cy: Dangosydd negyddol o dwyni symudol ac o laciau twyni

source: Mobile dune negative indicator, Fixed dune grassland negative indicator & Dune slack negative indicator
cy: Dangosydd negyddol o dwyni symudol, o laswelltir mewn twyni sefydlog, ac o laciau twyni

source: Dune slack positive indicator, Fixed dune positive indicator
cy: Dangosydd cadarnhaol o laciau twyni ac o dwyni sefydlog

source: Dune slack negative indicator
cy: Dangosydd negyddol o laciau twyni

source: Dune slacks negative indicator
cy: Dangosydd negyddol o laciau twyni

source: Dunescapes slack & Nitrogen loving
cy: Yn byw mewn llaciau twyni ac yn hoff o nitrogen

source: Fixed dune grassland positive indicator
cy: Dangosydd cadarnhaol o laswelltir mewn twyni sefydlog

source: Fixed dune grassland negative indicator
cy: Dangosydd negyddol o laswelltir mewn twyni sefydlog

source: Dune slack positive indicator
cy: Dangosydd cadarnhaol o laciau'r twyni

source: Confusion Species
cy: Rhywogaethau Tebyg

source: Bluebell (Hyacinthoides non-scripta), other bellflowers (Campanula spp.)
cy: Clychau'r gog (Hyacinthoides non-scripta), clychlysiau eraill (Campanula spp.)

source: Reflexed stonecrop
cy: Briweg felen

source: Sheep’s-bit scabious (Jasione montana)
cy: Clefryn (Jasione montana)

source: Sea clover (Trifolia squamosum)
cy: Meillionen y morfa (Trifolium squamosum)

source: Tormentil (Potentilla erecta), Creeping cinquefoil (Potentilla reptans)
cy: Tresgl y moch (Potentilla erecta), Pumnalen ymlusgol (Potentilla reptans)

source: Red Clover
cy: Meillionen goch

source: Broad leaved dock (Rumex obtusifolius), Copmmon sorrel (Rumex acetosa)
cy: Dail tafol (Rumex obtusifolius), Suran y cŵn (Rumex acetosa)

source: Spear thistle (Cirsium vulgare), Marsh thistle (Cirsium palustre)
cy: Marchysgallen (Cirsium vulgare), Ysgallen y gors (Cirsium palustre)

source: Dandelion species
cy: Rhywogaethau dant y llew

source: English stonecrop (Sedum anglicum)
cy: Briweg y cerrig (Sedum anglicum)

source: Common cudweed (Filago vulgaris)
cy: Edafeddog lwyd (Filago vulgaris)

source: Heath woodrush (Luzula multiflora)
cy: Coedfrwynen luosben (Luzula multiflora)

source: Squirrel-tail fescue (Vulpia bromoides)
cy: Peisgwellt cynffon gwiwer (Vulpia bromoides)

source: Ribwort plantain (Plantago lanceolata)
cy: Llyriad yr ais (Plantago lanceolata)

source: Devil’s bit scabious (Succisa pratensis)
cy: Tamaid y cythraul (Succisa pratensis)

source: Hawkbits (Leontodon spp.), Dandelions (Taraxacum spp.)
cy: Rhywogaethau peradyl (Leontodon spp.) a dant y llew (Taraxacum spp.)

source: Field maple (Acer campestre), Norway maple (Acer platanoides)
cy: Masarnen fach (Acer campestre), Masarnen Norwy (Acer platanoides)

source: Other pine species
cy: Rhywogaethau pinwydd eraill

source: Nothing. Other plantains at a push
cy: Dim. Llyriaid eraill o bosib

source: Other thistles, particularly Cotton thistle (Onopordum acanthium)
cy: Ysgall eraill, yn enwedig Ysgallen gotwm (Onopordum acanthium)

source: Brambles (Rubus spp.)
cy: Llwyni mwyar (Rubus spp.)

source: Dwarf gorse (Ulex minor), Western gorse (Ulex gallii)
cy: Coreithin (Ulex minor), Eithin mân (Ulex gallii)

source: Other heathers, especially Bell heather (Erica cinerea)
cy: Mathau eraill o rug, yn arbennig Grug y mêl (Erica cinerea)

source: Salad burnet (Sanguisorba minor)
cy: Bwrned (Sanguisorba minor)

source: Thyme-leaved sandwort (Arenaria serpyllifolia)
cy: Tywodlys dail teim (Arenaria serpyllifolia)

source: Prickly Saltwort
cy: Helys pigog

source: Hedge bindweed (Calystegia sepium), Field bindweed (Convolvulus arvensis), Great bindweed (Calystegia silvatica)
cy: Taglys y perthi (Calystegia sepium), Cwlwm y cythraul (Convolvulus arvensis), Taglys mawr (Calystegia silvatica)

source: Hybridised willow species typically including goat willow (S. caprea) and downy willow (S. lapponum)
cy: Rhywogaethau o helyg croesryw, yn aml yn cynnwys helyg deilgrwn (S. caprea) a Helyg pannog (S. lapponum)

source: Hybrids of mint
cy: Rhywogaethau mintys croesryw

source: The leaves are similar to Navelwort but this is found in much dryer habitats such as walls and quarries
cy: Mae'r dail yn debyg i'r Ddeilen gron, ond mae'r planhigyn hwn i'w weld mewn cynefinoedd llawer mwy sych, fel waliau a chwareli

source: Thistle species
cy: Rhywogaethau ysgall

source: St John’s Wort
cy: Eurinllys trydwll

source: Other perennial broad-leaved weeds
cy: Mathau eraill o chwyn lluosflwydd llydanddail

source: Common cow - wheat
cy: Gliniogai

source: Male fern
cy: Marchredynen gyffredin

source: Other buttercups
cy: Blodau-ymenyn eraill

source: Other members of the nightshade family
cy: Aelodau eraill o deulu'r codwarth

source: Other species of Eyebright and hybrids
cy: Rhywogaethau effros eraill ac effros croesryw

source: Birds - Foot Trefoil
cy: Pys-y-ceirw

source: Wild Raspberry
cy: Mafon gwyllt

source: Other sedges
cy: Mathau eraill o hesg

source: Other Agrimony spp
cy: Rhywogaethau Llysiau'r dryw

source: Purple dead nettle; henbit dead nettle
cy: Marddanhadlen goch; Marddanhadlen goch ddeilgron
